"common.ok" = "ОК";
"common.cancel" = "Отмена";
"common.save" = "Сохранить";
"common.done" = "Готово";
"common.na" = "н/д";
"app.language" = "app.language";

"language.section" = "Язык";
"language.system" = "Системный";
"language.english" = "Английский";
"language.russian" = "Русский";

"panel.title" = "Симулятор цифрового двойника БПЛА";
"panel.keyboard_hint" = "WASD/QE полет, Shift ускорение, 1..6 камеры, M карта, / компас, стрелки только FPV, +/- зум";
"panel.workflow_hint" = "Основные команды находятся в верхней ленте. Показывайте и скрывайте параметры кнопками панели.";
"panel.toggle_collapse" = "Свернуть/развернуть панель";
"panel.collapse" = "Свернуть панель";
"panel.expand" = "Развернуть панель";
"panel.parameters.on" = "Параметры: Вкл";
"panel.parameters.off" = "Параметры: Выкл";
"panel.hide" = "Скрыть панель параметров";
"panel.show" = "Показать панель параметров";
"panel.drone_profile" = "Профиль БПЛА";
"panel.model" = "Модель";
"panel.mass" = "Масса";
"panel.max_flight" = "Макс. время полета";
"panel.max_wind" = "Сопротивление ветру";
"panel.camera_layout" = "Компоновка камер";
"panel.visual_class" = "Визуальный класс";
"panel.commands" = "Команды";
"panel.position" = "Положение";
"panel.orientation" = "Ориентация";
"panel.throttle" = "Тяга";
"panel.camera" = "Камера";
"panel.camera_mode" = "Режим камеры";
"panel.weather" = "Погода";
"panel.terrain" = "Местность";
"panel.diagnostics" = "Диагностика";
"panel.fleet" = "Группа";
"panel.damage" = "Повреждения и состояние";
"panel.warnings" = "Предупреждения";
"panel.telemetry" = "Телеметрия";

"axis.x" = "X";
"axis.y" = "Y";
"axis.z" = "Z";
"axis.roll" = "Крен";
"axis.pitch" = "Тангаж";
"axis.yaw" = "Рыскание";

"camera.mode.free" = "Свободная";
"camera.mode.follow" = "Вид от хвоста";
"camera.mode.third_person" = "Вид сзади";
"camera.mode.fpv" = "FPV";
"camera.mode.orbit" = "Орбита";
"camera.mode.top" = "Вид сверху";
"camera.mode.payload" = "Сброс ПН";
"camera.mode.top_down" = "Вид сверху";
"camera.payload.auto_switch" = "Автопереход на камеру ПН после сброса";
"camera.fov" = "Угол обзора";
"camera.sensitivity" = "Чувствительность";
"camera.smoothing" = "Сглаживание";
"camera.orbit_distance" = "Дистанция орбиты";
"camera.follow_x" = "Смещение следования X";
"camera.follow_y" = "Смещение следования Y";
"camera.follow_z" = "Смещение следования Z";
"camera.fpv_stabilization" = "FPV стабилизация";
"camera.fpv_shake" = "FPV дрожание";

"command.reset" = "Сброс";
"command.takeoff" = "Взлет";
"command.land" = "Посадка";
"command.hover" = "Зависнуть";
"command.auto_path" = "Авто-маршрут";
"command.return_home" = "Возврат домой";
"command.emergency_stop" = "Аварийная остановка";
"command.start_animation" = "Запустить симуляцию";
"command.stop_animation" = "Остановить симуляцию";

"weather.normal" = "Обычная";
"weather.wind" = "Ветер";
"weather.rain" = "Дождь";
"weather.snow" = "Снег";
"weather.fog" = "Туман";
"weather.smog" = "Смог";
"weather.thunderstorm" = "Гроза";
"weather.intensity" = "Интенсивность";
"weather.wind_direction" = "Направление ветра";
"weather.wind_speed" = "Скорость ветра";
"weather.gusts" = "Порывы";

"terrain.grid_demo" = "Сетка (демо)";
"terrain.field" = "Поле";
"terrain.forest" = "Лес";
"terrain.cargo_yard" = "Грузовой порт";
"terrain.city" = "Город";
"terrain.density" = "Плотность объектов";
"terrain.seed" = "Сид генератора";
"terrain.scale" = "Масштаб карты";
"terrain.scale.4x4" = "4x4";
"terrain.scale.8x8" = "8x8";
"terrain.scale.16x16" = "16x16";
"terrain.scale.32x32" = "32x32";
"terrain.scale.64x64" = "64x64";
"terrain.scale.128x128" = "128x128";
"terrain.scale.256x256" = "256x256";
"environment.boundary_barrier_visible" = "Показывать граничный барьер";

"diagnostic.mode" = "Режим диагностики";
"diagnostic.mode.normal" = "Обычный вид";
"diagnostic.mode.thermal" = "Тепло / Нагрузка";
"diagnostic.mode.damage" = "Повреждения / Целостность";
"diagnostic.collision_debug" = "Отладка коллизий";
"diagnostic.toggle_thermal" = "Тепловая карта";
"diagnostic.toggle_damage" = "Карта повреждений";
"diagnostic.fleet_mode" = "Включить группу";

"fleet.formation" = "Построение";
"fleet.mode.off" = "Выкл";
"fleet.mode.line" = "Линия";
"fleet.mode.triangle" = "Треугольник";
"fleet.separation" = "Интервал";
"fleet.wingmen" = "Ведомые";
"fleet.risk" = "Риск между дронами";
"fleet.nearest" = "Минимальная дистанция";

"damage.reset" = "Сбросить повреждения";
"damage.clear_selection" = "Снять выбор";
"damage.hide" = "Скрыть";

"component.battery" = "Батарея";
"component.gimbal" = "Передняя камера / подвес";
"component.fc_core" = "Ядро полетного контроллера";
"component.motor_fl" = "Мотор FL";
"component.motor_fr" = "Мотор FR";
"component.motor_rl" = "Мотор RL";
"component.motor_rr" = "Мотор RR";
"component.propeller_fl" = "Пропеллер FL";
"component.propeller_fr" = "Пропеллер FR";
"component.propeller_rl" = "Пропеллер RL";
"component.propeller_rr" = "Пропеллер RR";
"component.arm_fl" = "Луч FL";
"component.arm_fr" = "Луч FR";
"component.arm_rl" = "Луч RL";
"component.arm_rr" = "Луч RR";
"component.esc_power" = "ESC / силовая электроника";

"warning.nominal" = "Норма";
"warning.warning" = "Внимание";
"warning.critical" = "Критично";
"warning.collision_high" = "Высокий риск столкновения";
"warning.impact_detected" = "Обнаружен удар";
"warning.stability_degraded" = "Устойчивость снижена";
"warning.control_reduced" = "Снижена управляемость";
"warning.weather_severe" = "Сложные погодные условия";
"warning.battery_low" = "Низкий заряд батареи";
"warning.integrity_low" = "Низкая структурная целостность";
"warning.fixedwing_low_speed" = "Низкая скорость самолётного БПЛА / риск сваливания";
"warning.fleet_risk" = "Риск в построении группы";
"warning.interdrone_critical" = "Критическое сближение дронов";
"warning.payload_self_interference" = "Сброс выполнен слишком близко к носителю";
"warning.emergency" = "Активирован аварийный режим";
"warnings.none" = "Активных предупреждений нет";
"summary.damage.none" = "Критичных повреждений нет";

"signal_loss.warning" = "Сигнал будет утерян через %d...";
"signal_loss.warning_stage_title" = "Предупредительная зона периметра";
"signal_loss.warning_stage_detail" = "Запас связи снижен, но полет полностью доступен внутри янтарной зоны.";
"signal_loss.critical_stage_title" = "Критическое приближение к краю";
"signal_loss.critical_stage_detail" = "Деградация связи усиливается. Вернитесь внутрь периметра до пересечения красной границы.";
"signal_loss.boundary_stage_title" = "Пересечена красная граница";
"signal_loss.boundary_stage_detail" = "Запущен countdown потери связи. Вернитесь внутрь карты, чтобы его сбросить.";
"signal_loss.lost_title" = "Сигнал потерян";
"signal_loss.lost_message" = "Сигнал потерян.";
"signal_loss.impact_title" = "СИГНАЛ ПОТЕРЯН: ОТКАЗ ПЛАНЕРА";
"signal_loss.impact_message" = "Ударное повреждение нарушило канал управления и бортовые системы.";
"signal_loss.recover" = "Восстановить";

"telemetry.position" = "Координаты";
"telemetry.velocity" = "Скорость (вектор)";
"telemetry.attitude" = "Ориентация";
"telemetry.speed" = "Скорость";
"telemetry.throttle" = "Тяга";
"telemetry.mode" = "Режим";
"telemetry.state" = "Состояние";
"telemetry.battery" = "Батарея";
"telemetry.power" = "Потребление";
"telemetry.remaining" = "Осталось";
"telemetry.weather" = "Погода";
"telemetry.collision_risk" = "Риск столкновения";
"telemetry.nearest_obstacle" = "Ближайшее препятствие";
"telemetry.emergency" = "Аварийное действие";
"telemetry.mission_status" = "Статус миссии";
"telemetry.damage" = "Повреждения";
"telemetry.thermal" = "Тепловая сводка";
"telemetry.fleet" = "Режим группы";
"telemetry.fleet_risk" = "Риск группы";
"telemetry.nearest_interdrone" = "До ближайшего дрона";
"telemetry.export" = "Экспорт телеметрии";
"telemetry.export.success" = "Телеметрия экспортирована";
"telemetry.export.failure" = "Ошибка экспорта телеметрии";

"mission.map.open_help" = "Карта миссии";
"mission.map.title" = "КАРТА МИССИИ";
"mission.map.subtitle" = "Экран планирования маршрута и зоны доставки полезной нагрузки";
"mission.map.exit" = "ВЫЙТИ ИЗ КАРТЫ";
"mission.map.clear_route" = "ОЧИСТИТЬ МАРШРУТ";
"mission.map.clear_drop_zone" = "ОЧИСТИТЬ ЗОНУ СБРОСА";
"mission.map.cancel" = "ОТМЕНИТЬ";
"mission.map.confirm" = "ПОДТВЕРДИТЬ МИССИЮ";
"mission.map.instruction.route" = "Кликните по карте, чтобы задать точку маршрута";
"mission.map.instruction.drop_zone_center" = "Кликните по карте, чтобы задать зоны сброса";
"mission.map.instruction.drop_zone_radius" = "Настройте радиус зоны и подтвердите миссию";
"mission.map.summary.format" = "БЛА %+.1f / %+.1f   БАЗА %+.1f / %+.1f   КАРТА %.0f м";
"mission.map.section.route" = "МАРШРУТ";
"mission.map.section.drop_zone" = "ЗОНА СБРОСА";
"mission.map.section.zone_radius" = "РАДИУС ЗОНЫ";
"mission.map.section.payload_delivery" = "ДОСТАВКА ПОЛЕЗНОЙ НАГРУЗКИ";
"mission.map.zone_radius.value" = "%.1f м";
"mission.map.auto_release" = "Автосброс над центром зоны";
"mission.map.payload_ready" = "Подвешенная полезная нагрузка готова к доставке";
"mission.map.payload_unavailable" = "Для этапа доставки нет прикрепленной полезной нагрузки";
"mission.map.active_drop_zone" = "ЗОНА ЕСТЬ";
"mission.map.no_drop_zone" = "ЗОНЫ НЕТ";
"mission.map.active_route" = "МАРШРУТ ЕСТЬ";
"mission.map.no_route" = "МАРШРУТА НЕТ";
"mission.map.footer_hint" = "Карта миссии не управляет БЛА напрямую. Подтвержденные цели передаются в существующий контур наведения.";
"mission.map.no_route_target" = "Маршрут не задан";
"mission.map.no_drop_zone_value" = "Зона сброса не задана";
"mission.map.route.value.format" = "X %+.1f   Z %+.1f";
"mission.map.drop_zone.value.format" = "ЦЕНТР %+.1f / %+.1f   R %.1f м";
"mission.mode.navigation" = "МАРШРУТ";
"mission.mode.drop_zone" = "ЗОНА СБРОСА";
"mission.status.map_active" = "КАРТА МИССИИ АКТИВНА";
"mission.status.drop_zone_set" = "ЗОНА СБРОСА ЗАДАНА";
"mission.status.delivery_ready" = "МИССИЯ ДОСТАВКИ ГОТОВА";
"mission.status.in_drop_zone" = "БЛА В ЗОНЕ СБРОСА";
"mission.status.payload_released" = "ПОЛЕЗНАЯ НАГРУЗКА СБРОШЕНА";
"mission.status.payload_on_target" = "ПОПАДАНИЕ В ЦЕЛЕВУЮ ЗОНУ";
"mission.status.payload_near_target" = "ПОПАДАНИЕ РЯДОМ С ЦЕЛЬЮ";
"mission.status.payload_off_target" = "ПОПАДАНИЕ ВНЕ ЦЕЛИ";

"hud.title" = "HUD телеметрии";
"hud.telemetry" = "Телеметрия";
"hud.camera" = "Камера";
"hud.drone" = "Дрон";

"mode.manual" = "Ручной";
"mode.fixed_wing_heading_hold" = "Удержание курса";
"mode.fixed_wing_altitude_hold" = "Удержание высоты";
"mode.fixed_wing_waypoint_intercept" = "Автопилот по точкам";
"mode.auto_path" = "Авто-маршрут";
"mode.return_home" = "Возврат домой";
"mode.hover" = "Зависание";
"mode.emergency_stop" = "Аварийная остановка";
"mode.takeoff" = "Взлет";
"mode.landing" = "Посадка";

"flight_state.on_ground" = "На земле";
"flight_state.battery_depleted" = "Батарея разряжена";
"flight_state.ascending" = "Набор высоты";
"flight_state.descending" = "Снижение";
"flight_state.emergency" = "Авария";
"flight_state.stable" = "Стабильно";
"flight_state.climbing" = "Подъем";
"flight_state.cruise" = "Крейсерский";

"emergency.none" = "Нет";
"emergency.slow_down" = "Снизить скорость";
"emergency.hover" = "Зависнуть";
"emergency.avoid" = "Обход";
"emergency.stop" = "Аварийная остановка";

"battery.depleted.title" = "Батарея разряжена";
"battery.depleted.message" = "Заряд полностью исчерпан. Выберите действие для продолжения.";
"battery.depleted.charge" = "Зарядить дрон";
"battery.depleted.restart" = "Перезапустить симуляцию";

"abstract.edit" = "Редактировать параметры";
"abstract.editor.title" = "Параметры абстрактного БЛА";
"abstract.editor.mass" = "Масса";
"abstract.editor.dimensions" = "Габариты";
"abstract.editor.energy" = "Энергия и ограничения";
"abstract.editor.control" = "Управляемость";
"abstract.validation.vertical" = "Скорость набора/снижения слишком мала.";
"abstract.validation.speed" = "Горизонтальная скорость должна быть >= вертикальных.";
"abstract.validation.radius" = "Радиус коллизии слишком велик для выбранных габаритов.";

"drone.model.abstract" = "Пользовательский БЛА";

"drone.visual.mini" = "Легкий компактный квадрокоптер";
"drone.visual.vector" = "Средний квадрокоптер с двумя камерами";
"drone.visual.atlas" = "Крупный профессиональный квадрокоптер";
"drone.visual.abstract" = "Пользовательский профиль";

"drone.camera.single_compact" = "Один компактный фронтальный подвес";
"drone.camera.dual_front" = "Двойной фронтальный камерный модуль";
"drone.camera.triple_front" = "Тройной фронтальный камерный модуль";
"drone.camera.custom" = "Пользовательский редактируемый модуль";

"ui.toggle_telemetry_hud" = "Переключить компактный HUD телеметрии";

"camera.zoom_sensitivity" = "Чувствительность зума";
"camera.free_speed" = "Скорость свободной камеры";
"camera.distance" = "Дистанция камеры";
"camera.fpv_yaw_limit" = "Лимит FPV рыскания";
"camera.fpv_pitch_limit" = "Лимит FPV тангажа";
"camera.fpv_near_clip" = "FPV ближняя отсечка";
"camera.fpv_mount_x" = "FPV крепление X";
"camera.fpv_mount_y" = "FPV крепление Y";
"camera.fpv_mount_z" = "FPV крепление Z";
"camera.fpv_hide_obstructing" = "Скрывать мешающие части дрона в FPV";

"keybind.section.title" = "Назначения клавиш";
"keybind.open" = "Горячие клавиши";
"keybind.category.flight" = "Управление полетом";
"keybind.category.camera" = "Управление камерой";
"keybind.category.ui" = "Управление интерфейсом";
"keybind.category.debug" = "Отладка / наложения";
"keybind.flight.forward" = "Вперед";
"keybind.flight.backward" = "Назад";
"keybind.flight.left" = "Влево";
"keybind.flight.right" = "Вправо";
"keybind.flight.descend" = "Снижение";
"keybind.flight.ascend" = "Набор высоты";
"keybind.flight.yaw_left" = "Рыскание влево";
"keybind.flight.yaw_right" = "Рыскание вправо";
"keybind.flight.accelerate" = "Ускорение";
"keybind.flight.hover" = "Зависание / стабилизация";
"keybind.flight.reset" = "Сброс дрона";
"keybind.camera.mode1" = "Камера 1 (Свободная)";
"payload.select" = "Полезная нагрузка";
"payload.configure" = "Настройка полезной нагрузки";
"payload.toolbar.open" = "Открыть модуль полезной нагрузки";
"payload.toolbar.close" = "Закрыть модуль полезной нагрузки";
"payload.section" = "НАСТРОЙКА ПОЛЕЗНОЙ НАГРУЗКИ";
"payload.console.subtitle" = "Операционный модуль полезной нагрузки для активного профиля БЛА";
"payload.type" = "Тип полезной нагрузки";
"payload.data_source" = "Источник данных полезной нагрузки";
"payload.data.verified" = "ПРОВЕРЕНО";
"payload.data.estimated" = "ПРИБЛИЗИТЕЛЬНО";
"payload.data.custom" = "ВРУЧНУЮ";
"payload.data.estimated_hint" = "Часть ограничений рассчитана по оценочным данным модели";
"payload.mass" = "Масса полезной нагрузки";
"payload.custom_name" = "Название";
"payload.status" = "Статус полезной нагрузки";
"payload.mount.title" = "Крепление";
"payload.mount.unavailable" = "НЕДОСТУПНО";
"payload.mount.ready" = "ГОТОВО";
"payload.mount.occupied" = "ЗАНЯТО";
"payload.limits.title" = "Ограничения БЛА";
"payload.base_mass" = "Масса БЛА";
"payload.battery_mass" = "Масса батареи";
"payload.max_payload" = "Лимит ПН";
"payload.max_takeoff" = "Макс. взлетная масса";
"payload.total_mass" = "Итоговая масса";
"payload.attach" = "Установить";
"payload.release" = "Сбросить";
"payload.remove" = "Снять";
"payload.mass_value" = "%.2f кг";
"payload.state.no_payload" = "НЕТ ПОЛЕЗНОЙ НАГРУЗКИ";
"payload.state.attached" = "УСТАНОВЛЕНА";
"payload.state.removed" = "СНЯТА";
"payload.state.released" = "СБРОШЕНА";
"payload.state.falling" = "ПАДАЕТ";
"payload.state.landed" = "ПРИЗЕМЛЕНА";
"payload.state.cleaned_up" = "УБРАНА";
"payload.message.attached" = "Полезная нагрузка установлена";
"payload.message.released" = "Полезная нагрузка сброшена";
"payload.message.dropped_successfully" = "Сброс полезной нагрузки выполнен";
"payload.message.impact_within_target" = "Событие контакта зарегистрировано в целевой зоне";
"payload.message.impact_near_target" = "Событие контакта зарегистрировано рядом с целевой зоной";
"payload.message.impact_off_target" = "Событие контакта зарегистрировано вне целевой зоны";
"payload.message.self_interference_risk" = "Носитель оказался слишком близко к зоне контакта";
"payload.message.cleanup_completed" = "Сброшенная полезная нагрузка удалена из сцены";
"payload.message.removed" = "Полезная нагрузка снята";
"payload.message.no_payload_attached" = "Полезная нагрузка не установлена";
"payload.message.select_uav" = "Сначала выберите БЛА";
"payload.message.payload_limit_exceeded" = "Масса полезной нагрузки превышает лимит выбранного БЛА";
"payload.message.takeoff_limit_exceeded" = "Итоговая масса превышает максимальную взлетную массу";
"payload.message.data_unavailable" = "Для этого профиля БЛА нет достаточных данных по полезной нагрузке";
"payload.message.invalid_mass" = "Задайте массу полезной нагрузки больше нуля";
"payload.type.cargo_box" = "Грузовой контейнер";
"payload.type.camera_gimbal" = "Камера";
"payload.type.thermal_camera" = "Тепловизор";
"payload.type.lidar_module" = "Лидар";
"payload.type.rescue_pack" = "Комплект первой помощи";
"payload.type.sensor_module" = "Сенсорный модуль";
"payload.type.radio_relay" = "Радиорелейный модуль";
"payload.type.custom" = "Пользовательская";
"control_mode.angle" = "Угловой";
"command.arm" = "Вооружить";
"command.disarm" = "Разоружить";
"telemetry.arm_state" = "Состояние: ";
"arm_state.armed" = "Вооружен";
"arm_state.disarmed" = "Разоружен";
"flight_state.disarmed" = "Разоружен";
"flight_state.armed_idle" = "Вооружен, ожидание";
"flight_state.crashed" = "Крушение";
"warning.disarmed" = "Аппарат разоружен";
"warning.integrity_critical" = "Критическое повреждение конструкции";
"warning.crashed" = "Аппарат потерпел крушение";
"warning.emergency_descent" = "Аварийное снижение";
"warning.crash_state" = "Состояние крушения";
"warning.signal_lost_impact" = "Сигнал потерян: ударное повреждение";
"damage.severity.nominal" = "Норма";
"damage.severity.light" = "Легкие";
"damage.severity.medium" = "Средние";
"damage.severity.critical" = "Критические";
"keybind.camera.mode2" = "Камера 2 ";
"keybind.camera.mode3" = "Камера 3 (Орбита)";
"keybind.camera.mode4" = "Камера 4 (От первого лица)";
"keybind.camera.mode5" = "Камера 5 (Вид сверху)";
"keybind.camera.mode6" = "Камера 6 (Падение полезной нагрузки)";
"keybind.camera.toggle_fpv" = "Переключить от первого лица";
"keybind.camera.cycle_mode" = "Смена режима камеры";
"keybind.camera.zoom_in" = "Приблизить";
"keybind.camera.zoom_out" = "Отдалить";
"keybind.camera.yaw_left" = "Камера: влево";
"keybind.camera.yaw_right" = "Камера: вправо";
"keybind.camera.pitch_up" = "Камера: вверх";
"keybind.camera.pitch_down" = "Камера: вниз";
"keybind.camera.reset_orientation" = "Сброс ориентации камеры";
"workspace.toolstrip" = "Панель инструментов";
"toolstrip.tab.simulation" = "Симуляция";
"toolstrip.tab.flight" = "Полет";
"toolstrip.tab.camera" = "Камера";
"toolstrip.tab.environment" = "Окружение";
"toolstrip.tab.debug" = "Отладка";
"toolstrip.tab.projects" = "Проекты";
"toolstrip.section.run" = "Управление запуском";
"toolstrip.section.flight_model" = "Аппарат и режим";
"toolstrip.section.throttle" = "Тяга";
"toolstrip.section.camera_modes" = "Режимы камеры";
"toolstrip.section.camera_quick" = "Пресеты камеры";
"toolstrip.section.weather" = "Погода";
"toolstrip.section.terrain" = "Местность";
"toolstrip.section.debug" = "Диагностика";
"toolstrip.section.projects" = "Действия проекта";
"camera.zoom_in" = "Приблизить";
"camera.zoom_out" = "Отдалить";
"camera.reset_orientation" = "Сбросить вид";
"panel.collision_debug" = "Отладка коллизий";
"window.fullscreen" = "Полный экран";
"keybind.ui.toggle_panel" = "Свернуть / развернуть панель";
"keybind.ui.toggle_mission_map" = "Открыть / закрыть карту миссии";
"keybind.ui.toggle_payload" = "Открыть / закрыть полезную нагрузку";
"keybind.ui.toggle_hud" = "Переключить интерфейс телеметрии";
"keybind.flight.release_payload" = "Сбросить полезную нагрузку";
"keybind.debug.toggle_damage" = "Переключить карту повреждений";
"keybind.debug.toggle_thermal" = "Переключить тепловую карту";
"keybind.capture.idle" = "Выберите действие и нажмите переназначение.";
"keybind.capture.prompt" = "Нажмите клавишу для \"%@\" (Esc для отмены)";
"keybind.rebind" = "Переназначить";
"keybind.capturing" = "Ожидание…";
"keybind.reset_defaults" = "Сброс по умолчанию";
"keybind.key.space" = "Пробел";
"keybind.key.code" = "Клавиша %d";

"control_mode.title" = "Режим управления полетом";
"control_mode.stabilized" = "Стабилизированный";
"control_mode.acro" = "Акро";
"control_mode.hover_assist" = "Удержание высоты";

"common.export" = "Экспорт";

"camera.preset" = "Пресет камеры";
"camera.preset.cinematic" = "Кинематографичный";
"camera.preset.pilot" = "Пилот";
"camera.preset.inspection" = "Инспекция";
"camera.preset.wide_follow" = "Широкое следование";
"camera.preset.tight_follow" = "Близкое следование";
"camera.preset.fpv" = "От первого лица";
"camera.reset_to_preset" = "Сбросить к пресету";
"camera.advanced" = "Расширенные настройки камеры";
"camera.invert_x" = "Инвертировать X";
"camera.invert_y" = "Инвертировать Y";
"camera.sensitivity_profile" = "Профиль чувствительности";
"camera.sensitivity.low" = "Низкий";
"camera.sensitivity.medium" = "Средний";
"camera.sensitivity.high" = "Высокий";

"section.flight" = "Полет";
"section.camera" = "Камера";
"section.environment" = "Среда";
"section.diagnostics" = "Диагностика";
"section.advanced" = "Расширенные";

"diagnostic.last_collision_source" = "Источник последней коллизии";
"diagnostic.active_objects" = "Активные объекты";
"diagnostic.active_physics" = "Физические тела";
"diagnostic.active_particles" = "Частицы";

"telemetry.control_mode" = "Режим управления";
"telemetry.nearest_obstacle_source" = "Источник ближайшего препятствия";
"telemetry.frame_time" = "Кадр";
"telemetry.physics_time" = "Физика";
"telemetry.render_time" = "Рендер";
"telemetry.path_time" = "Планировщик";
"telemetry.active_objects" = "Объекты";
"telemetry.active_physics_bodies" = "Физические тела";
"telemetry.particle_count" = "Частицы";

"drone.model.fixed_rect" = "БПЛА с прямым крылом";
"drone.model.fixed_delta" = "БПЛА дельта-крыло";
"drone.model.fixed_swept" = "БПЛА со стреловидным крылом";
"drone.visual.fixed_rect" = "Самолётное семейство с прямым крылом";
"drone.visual.fixed_delta" = "Самолётное семейство типа «дельта»";
"drone.visual.fixed_swept" = "Самолётное семейство со стреловидным крылом";
"drone.camera.fixed_front" = "Фронтальная камера самолётного БПЛА";

"menu.title" = "Проекты БПЛА";
"menu.saved_projects" = "Сохраненные проекты";
"menu.create_project" = "Создать проект";
"menu.recent_project" = "Последний проект";
"menu.search" = "Поиск проекта";
"menu.sort" = "Сортировка";

"project.name" = "Имя проекта";
"project.sort.newest" = "Сначала новые";
"project.sort.name" = "По имени";
"project.sort.recent" = "Недавно открытые";
"project.create.title" = "Создание проекта";
"project.create.action" = "Создать";
"project.open.action" = "Открыть список проектов";
"project.open.failure" = "Не удалось открыть проект";
"project.save.action" = "Сохранить проект";
"project.save_as.action" = "Сохранить как";
"project.save_as.title" = "Сохранить проект как";
"project.save.success" = "Проект сохранен";
"project.save.failure" = "Ошибка сохранения проекта";
"project.duplicate.title" = "Дублировать проект";
"project.duplicate.action" = "Дублировать проект";
"project.duplicate.success" = "Проект продублирован";
"project.duplicate.failure" = "Ошибка дублирования проекта";
"project.delete.action" = "Удалить проект";
"project.delete.failure" = "Не удалось удалить проект";
"project.delete.confirm.title" = "Удаление проекта";
"project.delete.confirm.message" = "Удалить проект '%@'?";

"project.unsaved.title" = "Несохраненные изменения";
"project.unsaved.message" = "Сохранить проект '%@'?\nНесохраненные изменения могут быть потеряны.";
"project.unsaved.save" = "Сохранить";
"project.unsaved.save_exit" = "Сохранить и выйти";
"project.unsaved.exit_without" = "Выйти без сохранения";

"telemetry.export.select_folder" = "Выберите папку для экспорта файла телеметрии.";
"control_mode.acro" = "Акро / скоростной";
"control_mode.hover_assist" = "Зависание / удержание высоты";

"section.flight" = "Полет";
"section.camera" = "Камера";
"section.environment" = "Окружение";
"section.diagnostics" = "Диагностика";
"section.advanced" = "Расширенные";

"camera.preset" = "Пресет камеры";
"camera.preset.cinematic" = "Кинематограф";
"camera.preset.pilot" = "Пилот";
"camera.preset.inspection" = "Инспекция";
"camera.preset.wide_follow" = "Широкое следование";
"camera.preset.tight_follow" = "Плотное следование";
"camera.preset.fpv" = "От первого лица";
"camera.reset_to_preset" = "Сброс к пресету";
"camera.advanced" = "Расширенная камера";
"camera.sensitivity_profile" = "Профиль чувствительности";
"camera.sensitivity.low" = "Низкий";
"camera.sensitivity.medium" = "Средний";
"camera.sensitivity.high" = "Высокий";
"camera.invert_x" = "Инвертировать X";
"camera.invert_y" = "Инвертировать Y";

"diagnostic.last_collision_source" = "Источник последнего столкновения";
"diagnostic.active_objects" = "Активные объекты";
"diagnostic.active_physics" = "Активные физические тела";
"diagnostic.active_particles" = "Количество частиц";

"telemetry.control_mode" = "Режим управления";
"telemetry.nearest_obstacle_source" = "Источник ближайшего препятствия";
"telemetry.frame_time" = "Время кадра";
"telemetry.physics_time" = "Время физики";
"telemetry.render_time" = "Время рендера";
"telemetry.path_time" = "Время поиска пути";
"telemetry.active_objects" = "Активные объекты";
"telemetry.active_physics_bodies" = "Физические тела";
"telemetry.particle_count" = "Частицы";

"drone.model.fixed_rect" = "БПЛА с прямым крылом";
"drone.model.fixed_delta" = "БПЛА с дельта-крылом";
"drone.model.fixed_swept" = "БПЛА со стреловидным крылом";
"drone.model.ebee_class" = "Картографический БПЛА класса eBee";
"drone.model.ux11_class" = "Съёмочный БПЛА класса UX11";
"drone.model.wingtra_class" = "VTOL БПЛА класса Wingtra";
"drone.model.trinity_class" = "Профессиональный БПЛА класса Trinity";

"drone.visual.fixed_rect" = "Самолётное семейство с прямым крылом";
"drone.visual.fixed_delta" = "Самолётное семейство типа «дельта»";
"drone.visual.fixed_swept" = "Самолётное семейство со стреловидным крылом";
"drone.visual.ebee_class" = "Бесхвостая летающая платформа для картографии";
"drone.visual.ux11_class" = "Классический самолётный БПЛА для аэросъёмки";
"drone.visual.wingtra_class" = "VTOL fixed-wing типа tailsitter";
"drone.visual.trinity_class" = "Профессиональная survey eVTOL-платформа";

"drone.camera.fixed_front" = "Фронтальная камера самолётного БПЛА";

"common.not_specified" = "Не указано";

"country.china" = "Китай";
"country.united_states" = "США";
"country.norway" = "Норвегия";
"country.switzerland" = "Швейцария";
"country.germany" = "Германия";
"country.israel" = "Израиль";
"country.poland" = "Польша";
"country.canada" = "Канада";
"country.user_defined" = "Задано пользователем";

"uav.filter.type" = "Тип";
"uav.filter.mass" = "Масса";
"uav.filter.vehicle.all" = "Все";
"uav.filter.vehicle.multicopters" = "Мультикоптеры";
"uav.filter.vehicle.helicopters" = "Вертолетные";
"uav.filter.vehicle.fixed_wing" = "Самолетные";
"uav.filter.vehicle.hybrid_vtol" = "Гибриды VTOL";
"uav.filter.mass.all" = "Все";
"uav.filter.mass.nano" = "Нано";
"uav.filter.mass.micro" = "Микро";
"uav.filter.mass.light" = "Легкие";
"uav.filter.mass.medium" = "Средние";
"uav.filter.mass.heavy" = "Тяжелые";

"uav.vehicle.multicopter" = "Мультикоптер";
"uav.vehicle.fixed_wing" = "Самолетный";
"uav.vehicle.hybrid_vtol" = "Гибрид VTOL";
"uav.vehicle.helicopter" = "Вертолетный";
"uav.vehicle.custom" = "Пользовательский";

"uav.mass.nano" = "Нано";
"uav.mass.micro" = "Микро";
"uav.mass.light" = "Легкий";
"uav.mass.medium" = "Средний";
"uav.mass.heavy" = "Тяжелый";
"uav.mass.custom" = "Пользовательский";

"uav.spec.verified" = "Проверен";
"uav.spec.partial" = "Частичный";
"uav.spec.custom" = "Пользовательский";

"uav.badge.custom" = "КАСТОМ";
"uav.catalog.title" = "Каталог БЛА";
"uav.catalog.empty" = "Нет профилей БЛА, соответствующих текущим фильтрам.";
"uav.catalog.edit_abstract" = "Редактировать абстрактный БЛА";
"uav.catalog.selected_outside_filter" = "Выбранная модель не входит в текущий фильтр";

"uav.card.title" = "Выбранный БЛА";
"uav.card.manufacturer" = "Производитель";
"uav.card.country" = "Страна";
"uav.card.type" = "Тип";
"uav.card.mass_class" = "Массовый класс";
"uav.card.base_mass" = "Масса БЛА";
"uav.card.max_payload" = "Макс. полезная нагрузка";
"uav.card.mtow" = "Макс. взлетная масса";
"uav.card.role" = "Роль";
"uav.card.status" = "Статус";
"uav.card.payload_data_source" = "Данные ПН";
"uav.card.armament_note" = "Примечание по вооружению";
"uav.card.empty" = "Профиль БЛА не выбран";

"uav.manufacturer.custom" = "Пользовательский";

"uav.profile.abstract-uav.display_name" = "Абстрактный БЛА";
"uav.profile.dji-matrice-350-rtk.short_description" = "Промышленный квадрокоптер с шасси, центральным отсеком подвеса и поддержкой модульной полезной нагрузки.";
"uav.profile.dji-matrice-350-rtk.mission_role" = "Инспекция, картография и задачи общественной безопасности";
"uav.profile.dji-flycart-30.short_description" = "Тяжелый грузовой мультикоптер с коаксиальными подъемными группами и центральным нижним грузовым отсеком.";
"uav.profile.dji-flycart-30.mission_role" = "Грузовая доставка и логистика";
"uav.profile.dji-mavic-4-pro.short_description" = "Складной потребительский мультикоптер с трехкамерным передним подвесом.";
"uav.profile.dji-mavic-4-pro.mission_role" = "Потребительская аэросъемка и съемка для создателей контента";
"uav.profile.dji-neo.short_description" = "Сверхкомпактный мультикоптер с защитой пропеллеров для роли легкой персональной летающей камеры.";
"uav.profile.dji-neo.mission_role" = "Персональная аэросъемка";
"uav.profile.dji-phantom-3-standard.short_description" = "Классический квадрокоптер Phantom со встроенным шасси и передним отсеком подвеса камеры.";
"uav.profile.dji-phantom-3-standard.mission_role" = "Потребительская аэросъемка";
"uav.profile.freefly-alta-x.short_description" = "Тяжелый мультикоптер с открытой рамой для кино- и индустриальных задач и центральной нижней секцией полезной нагрузки.";
"uav.profile.freefly-alta-x.mission_role" = "Тяжелая кино- и индустриальная перевозка полезной нагрузки";
"uav.profile.griff-30.short_description" = "Тяжелый грузовой БЛА с крупной транспортной рамой и нижней зоной подвеса груза.";
"uav.profile.griff-30.mission_role" = "Тяжелая грузовая перевозка";
"uav.profile.griff-60.short_description" = "Крупный тяжелый грузовой БЛА с более грузоподъемной рамой, чем у Griff 30.";
"uav.profile.griff-60.mission_role" = "Тяжелая грузовая перевозка";
"uav.profile.avidrone-490tl.short_description" = "Грузовой БЛА вертолетного типа с тандемными роторами, вытянутым фюзеляжем и нижней грузовой позицией.";
"uav.profile.avidrone-490tl.mission_role" = "Грузовая перевозка и утилитарный подъем";
"uav.profile.wingtraone-gen-ii.short_description" = "Гибридный картографический VTOL-самолет с нижним отсеком съемочного оборудования и крейсерской самолетной схемой.";
"uav.profile.wingtraone-gen-ii.mission_role" = "Картографическая съемка и фотограмметрия";
"uav.profile.quantum-systems-trinity-pro.short_description" = "Дальнопролетный eVTOL-самолет для съемки с центральным сенсорным отсеком под фюзеляжем.";
"uav.profile.quantum-systems-trinity-pro.mission_role" = "Картография и инспекция линейных объектов";
"uav.profile.mq-9b-skyguardian.short_description" = "Крупная платформа MALE самолетного типа с длинным крылом, носовой сенсорной архитектурой и многоточечной полезной нагрузкой.";
"uav.profile.mq-9b-skyguardian.mission_role" = "Длительное ISR-наблюдение и многоцелевая патрульная работа";
"uav.profile.hermes-900.short_description" = "Многоцелевая платформа MALE с длинным крылом, толкающей схемой и сенсорными станциями под носом и фюзеляжем.";
"uav.profile.hermes-900.mission_role" = "Многоцелевая ISR-разведка и морское патрулирование";
"uav.profile.ft5-los.short_description" = "Двухдвигательная тактическая самолетная платформа с компактным разведывательным планером и модульной интеграцией полезной нагрузки.";
"uav.profile.ft5-los.mission_role" = "Тактическая разведка и ISTAR";
"uav.profile.flyeye.short_description" = "Легкий самолетный разведывательный БЛА с компактным фюзеляжем и нижней электрооптической полезной нагрузкой.";
"uav.profile.flyeye.mission_role" = "Ближняя разведка и наблюдение";
"uav.profile.abstract-uav.short_description" = "Пользовательский профиль БЛА для будущей настройки параметров.";
"uav.profile.abstract-uav.mission_role" = "Пользовательская задача";

"telemetry.path_status" = "Статус маршрута";
"telemetry.path_status.idle" = "Ожидание";
"telemetry.path_status.valid" = "Готов";
"telemetry.path_status.recomputing" = "Перестроение";
"telemetry.path_status.blocked" = "Заблокирован";
"telemetry.auto_nav" = "Автонавигация";
"telemetry.auto_nav.active" = "ВКЛ";
"telemetry.auto_nav.inactive" = "ВЫКЛ";
"telemetry.control_authority" = "Источник управления";
"telemetry.input_flags" = "Флаги ввода";
"telemetry.state_flags" = "Флаги состояния";
"common.on" = "ВКЛ";
"common.off" = "ВЫКЛ";
"telemetry.target_distance" = "Дист. до цели";
"telemetry.target_bearing" = "Пеленг на цель";
"telemetry.waypoint" = "Маршрутная точка";
"telemetry.waypoint.value" = "индекс %d, осталось %d";
"telemetry.path_remaining" = "Остаток маршрута";
"telemetry.fixed_wing_state" = "FW миссия";
"telemetry.fixed_wing_track" = "FW траектория";
"telemetry.fixed_wing_track.format" = "курс %.0f° | бок. откл %.1f м";
"telemetry.fixed_wing_energy" = "FW энергия";
"telemetry.fixed_wing_energy.format" = "скорость %.1f м/с | высота %.1f м";
"telemetry.fixed_wing_commands" = "FW команды";
"telemetry.fixed_wing_commands.format" = "крен %.1f° | тангаж %.1f° | газ %.0f%%";
"telemetry.fixed_wing_recovery" = "FW восстановление скорости";
"telemetry.fixed_wing_progress" = "FW прогресс";
"telemetry.fixed_wing_progress.format" = "продвижение %.2f";
"telemetry.fixed_wing_battery" = "FW батарея";
"telemetry.fixed_wing_transition" = "FW переход";
"telemetry.mode_transition_reason" = "Причина режима";
"telemetry.mission_abort_reason" = "Причина прерывания";

"panel.modules.on" = "Модули: Вкл";
"panel.modules.off" = "Модули: Выкл";

"toolbar.cluster.status" = "Текущий статус";
"toolbar.cluster.status.subtitle" = "Текущий контур управления и активный модуль";
"toolbar.cluster.project" = "Действия проекта";
"toolbar.cluster.project.subtitle" = "Сохранение сессии и управление окном";
"toolbar.cluster.utility" = "Инструменты оператора";
"toolbar.cluster.utility.subtitle" = "Горячие клавиши, интерфейс и язык";

"sidebar.metric.mode" = "Режим";
"sidebar.metric.state" = "Состояние";
"sidebar.metric.camera" = "Камера";
"sidebar.metric.platform" = "Платформа";
"sidebar.metric.battery" = "Батарея";
"sidebar.metric.warnings" = "Предупреждения";
"sidebar.metric.throttle" = "Тяга";
"sidebar.metric.preset" = "Пресет";
"sidebar.metric.fov" = "Угол обзора";
"sidebar.metric.distance" = "Дистанция";
"sidebar.metric.weather" = "Погода";
"sidebar.metric.terrain" = "Рельеф";
"sidebar.metric.wind" = "Ветер";
"sidebar.metric.boundary" = "Контур";
"sidebar.metric.manufacturer" = "Производитель";
"sidebar.value.on" = "Вкл";
"sidebar.value.off" = "Выкл";

"toolbar.header.project" = "Действия проекта";

"module.panel.idle" = "МОДУЛИ";
"module.panel.idle.subtitle" = "Выберите инструмент на панели, чтобы открыть рабочий модуль";

"module.flight_ops.title" = "ПОЛЕТНЫЕ ОПЕРАЦИИ";
"module.flight_ops.toolbar_title" = "Полет";
"module.flight_ops.subtitle" = "Запуск, возврат и управление тягой";
"module.flight_ops.command_stack" = "Блок команд";
"module.flight_ops.command_stack.subtitle" = "Основные действия аппарата и автоматические режимы";
"module.flight_ops.fixed_wing_assist" = "Автопилот самолёта";
"module.flight_ops.fixed_wing_assist.subtitle" = "Плавный пролёт по точкам по схеме carrot-pursuit, плюс ручные удержания курса и высоты";
"module.flight_ops.control_law" = "Режим управления";
"module.flight_ops.control_law.subtitle" = "Переключение законов управления без выхода из сцены";
"module.flight_ops.active_mode" = "АКТИВЕН";
"module.flight_ops.thrust" = "Канал тяги";
"module.flight_ops.thrust.subtitle" = "Прямая тяга и фиксированные уставки";
"module.flight_ops.override" = "Безопасность / Сброс";
"module.flight_ops.override.subtitle" = "Питание симуляции, восстановление и аварийный стоп";

"module.uav_catalog.title" = "КАТАЛОГ БЛА";
"module.uav_catalog.toolbar_title" = "БЛА";
"module.uav_catalog.subtitle" = "Выбор платформы и активного профиля";
"module.uav_catalog.selection" = "Сводка платформ";
"module.uav_catalog.selection.subtitle" = "Состояние фильтра и текущего выбора";
"module.uav_catalog.metric.active" = "Активный профиль";
"module.uav_catalog.metric.filtered" = "После фильтра";
"module.uav_catalog.metric.type" = "Тип аппарата";
"module.uav_catalog.metric.mass" = "Массовый класс";
"module.uav_catalog.list.subtitle" = "Фильтры каталога, список платформ и карточка профиля";

"module.payload.title" = "ПОЛЕЗНАЯ НАГРУЗКА";
"module.payload.toolbar_title" = "ПН";

"module.camera.title" = "КАМЕРА";
"module.camera.toolbar_title" = "Камера";
"module.camera.subtitle" = "Ракурс, оптика и настройка от первого лица";
"module.camera.mode_stack" = "Режимы камеры";
"module.camera.mode_stack.subtitle" = "Рабочие режимы наблюдения за сценой";
"module.camera.active_mode" = "В РАБОТЕ";
"module.camera.presets" = "Набор пресетов";
"module.camera.presets.subtitle" = "Миссионные пресеты и быстрый сброс вида";
"module.camera.optics" = "Оптика";
"module.camera.optics.subtitle" = "Дистанция камеры и угол обзора";
"module.camera.advanced.subtitle" = "Раскрывать только при необходимости глубокой настройки";
"module.camera.show_advanced" = "Показать расширенную настройку камеры";
"module.camera.hide_advanced" = "Скрыть расширенную настройку камеры";
"module.camera.fpv_stack" = "Параметры FPV";
"module.camera.preset_hint.cinematic" = "Широкий и плавный ракурс для презентационного полета";
"module.camera.preset_hint.pilot" = "Сбалансированный операторский вид для общего пилотажа";
"module.camera.preset_hint.inspection" = "Более близкое кадрирование для осмотра объектов";
"module.camera.preset_hint.wide_follow" = "Увеличенная дистанция следования для обстановки";
"module.camera.preset_hint.tight_follow" = "Плотное следование для точной работы";
"module.camera.preset_hint.fpv" = "Кокпитный вид с прямой осью наблюдения";

"module.scenario.title" = "СЦЕНАРИЙ";
"module.scenario.toolbar_title" = "Сценарий";
"module.scenario.subtitle" = "Погода, местность и габариты рабочей зоны";
"module.scenario.weather" = "Погодный профиль";
"module.scenario.weather.subtitle" = "Пресеты и интенсивность внешних условий";
"module.scenario.show_weather_tuning" = "Показать параметры ветра";
"module.scenario.hide_weather_tuning" = "Скрыть параметры ветра";
"module.scenario.active_preset" = "АКТИВЕН";
"module.scenario.terrain" = "Профиль местности";
"module.scenario.terrain.subtitle" = "Масштаб карты, плотность и граничный контур";
"module.scenario.active_profile" = "АКТИВЕН";

"module.diagnostics.title" = "ДИАГНОСТИКА";
"module.diagnostics.toolbar_title" = "Диагностика";
"module.diagnostics.subtitle" = "Телеметрия, системные состояния и техническое состояние";
"module.diagnostics.overlay" = "Режимы наложения";
"module.diagnostics.overlay.subtitle" = "Служебные слои и диагностическая видимость";
"module.diagnostics.runtime_summary" = "Системная сводка";
"module.diagnostics.runtime_summary.subtitle" = "Счетчики кадра, физики, рендера и объектной нагрузки";
"module.diagnostics.telemetry" = "Блок телеметрии";
"module.diagnostics.telemetry.subtitle" = "Расширенный вывод миссии, питания и производительности";
"module.diagnostics.warning_bus" = "Лента предупреждений";
"module.diagnostics.warning_bus.subtitle" = "Текущие тревоги от полета, батареи и среды";
"module.diagnostics.fleet" = "Координация группы";
"module.diagnostics.fleet.subtitle" = "Поведение ведомых и дистанция строя";
"module.diagnostics.damage" = "Повреждения / Тепло";
"module.diagnostics.damage.subtitle" = "Видимость компонентов и контроль целостности";
"module.diagnostics.station" = "Станционные настройки";
"module.diagnostics.station.subtitle" = "Язык оператора и локальные параметры рабочего места";
"module.diagnostics.panel.overview" = "Обзор";
"module.diagnostics.panel.telemetry" = "Телеметрия";
"module.diagnostics.panel.fleet" = "Группа";
"module.diagnostics.panel.service" = "Сервис";

"project.default_name" = "Проект %@";
"project.copy_suffix" = "копия";
"project.clone_suffix" = "дубликат";

"control_authority.none" = "НЕТ";
"control_authority.manual" = "РУЧНОЕ";
"control_authority.marker" = "МЕТКА";
"control_authority.failsafe" = "АВАРИЙНЫЙ";
"control_authority.blocked" = "БЛОК";

"payload_camera.state.inactive" = "ВЫКЛ";
"payload_camera.state.falling" = "ПАДЕНИЕ";
"payload_camera.state.impact" = "УДАР";
"payload_camera.state.rest" = "ПОКОЙ";

"overlay.payload_view.title" = "КАМЕРА ПОЛЕЗНОЙ НАГРУЗКИ";
"overlay.payload_view.metric.alt" = "ВЫС";
"overlay.payload_view.metric.vertical_speed" = "V/S";
"overlay.payload_view.metric.time" = "ВРЕМ";
"overlay.payload_view.metric.state" = "СТАТ";

"overlay.terrain_map.title" = "КАРТА МЕСТНОСТИ";
"overlay.terrain_map.subtitle" = "Обзор препятствий и одиночная целевая метка";
"overlay.terrain_map.clear" = "СБР";
"overlay.terrain_map.target_metrics.empty" = "ДИСТ —   ПЕЛ —";
"overlay.terrain_map.target_metrics.format" = "ДИСТ %.1f м   ПЕЛ %03.0f°";
"overlay.terrain_map.heading_alt_objects.format" = "КУР %@°   ВЫС %.1f м   ОБЪ %d";
"overlay.terrain_map.position_map.format" = "X %+.1f   Z %+.1f   КАРТА %@";
"overlay.terrain_map.status.format" = "СИГ %@   АВТОНАВ %@";

"overlay.compass.title" = "КОМПАС";
"overlay.compass.subtitle" = "Курс / север / пеленг цели";
"overlay.compass.metric.heading" = "КУР";
"overlay.compass.metric.north" = "С";
"overlay.compass.metric.bearing" = "ПЕЛ";
"overlay.compass.marker.current" = "КУР";
"overlay.compass.marker.target" = "ЦЕЛ";

"hud.compact.position" = "ПОЗ  x %.1f  y %.1f  z %.1f";
"hud.compact.speed_battery" = "СКР  %.1f м/с   АКБ %.0f%%";
"hud.compact.auto_nav" = "АВТО %@  ДИСТ %@  ПЕЛ %@";

"telemetry.flags.input.format" = "РУЧ %@ | МЕТ %@ | ПН %@ | КАРТ %@";
"telemetry.flags.state.format" = "РАЗ %@ | БЛК %@ | СИГ %@";
"telemetry.flags.mission.format" = "КАРТ %@ | ЗС %@ | ГОТ %@ | В %@ | СБР %@";

"tactical.map.title" = "ТАКТИЧЕСКАЯ КАРТА";
"tactical.map.subtitle" = "Черновик, план и запуск миссии поверх существующего автопилота.";
"tactical.map.mode.waypoint" = "ТОЧКИ";
"tactical.map.mode.launch_object" = "СТАРТ";
"tactical.map.mode.drop_zone" = "ЗОНА СБРОСА";
"tactical.map.mode.no_fly_zone" = "NO-FLY";
"tactical.map.instruction.waypoint" = "Кликните по карте, чтобы добавить следующую точку маршрута.";
"tactical.map.instruction.launch_object" = "Кликните по карте, чтобы поставить или заменить стартовый объект и задать коридор запуска.";
"tactical.map.instruction.drop_zone" = "Кликните по карте, чтобы поставить или переместить зону сброса.";
"tactical.map.instruction.no_fly_zone" = "Кликните по карте, чтобы поставить ещё одну запретную зону.";
"tactical.map.section.status" = "СТАТУС ЧЕРНОВИКА";
"tactical.map.section.route" = "ПРЕДПРОСМОТР МАРШРУТА";
"tactical.map.section.zones" = "ЗОНЫ";
"tactical.map.section.actions" = "ДЕЙСТВИЯ";
"tactical.map.zone.drop_zone" = "Зона сброса";
"tactical.map.zone.no_fly_zone" = "Запретная зона";
"tactical.map.zone.empty" = "Зона не задана.";
"tactical.map.zone.radius.value" = "%.1f м | x %.1f | y %.1f";
"tactical.map.zone.radius.value.multiple" = "%.1f м | x %.1f | y %.1f | зон %d";
"tactical.map.metric.span" = "КАРТА";
"tactical.map.metric.drop_zone" = "СБРОС";
"tactical.map.metric.link_status" = "СВЯЗЬ";
"tactical.map.metric.safe_return" = "ВОЗВРАТ";
"tactical.map.metric.edge_distance" = "КРАЙ";
"tactical.map.metric.geofence" = "ПЕРИМЕТР";
"tactical.map.metric.mode" = "РЕЖИМ";
"tactical.map.metric.scale_status" = "МАСШТАБ";
"tactical.map.metric.operational_radius" = "РАДИУС";
"tactical.map.metric.route_distance" = "МАРШРУТ";
"tactical.map.metric.preview" = "ПРЕВЬЮ";
"tactical.map.metric.link_radius" = "ЛИНК";
"tactical.map.metric.waypoints" = "ТОЧКИ";
"tactical.map.metric.zones" = "ЗОНЫ";
"tactical.map.metric.segments" = "СЕГМЕНТЫ";
"tactical.map.preview.none" = "Нет preview";
"tactical.map.preview.unavailable" = "Превью недоступно";
"tactical.map.link.nominal" = "Норма";
"tactical.map.link.warning" = "Предупреждение";
"tactical.map.link.critical" = "Критично";
"tactical.map.link.lost" = "Потеря";
"tactical.map.safe_return.ok" = "Готов";
"tactical.map.safe_return.limit" = "Предел";
"tactical.map.direction.north" = "Север";
"tactical.map.direction.south" = "Юг";
"tactical.map.direction.east" = "Восток";
"tactical.map.direction.west" = "Запад";
"tactical.map.geofence.nominal" = "НОРМА";
"tactical.map.geofence.warning" = "ПРЕДУПРЕЖДЕНИЕ";
"tactical.map.geofence.critical" = "КРИТИЧНО";
"tactical.map.geofence.outside" = "ВНЕ ПЕРИМЕТРА";
"tactical.map.legend.boundary" = "Граница карты";
"tactical.map.legend.warning_band" = "Предупредительная зона";
"tactical.map.legend.critical_band" = "Критическая зона";
"tactical.map.legend.route" = "Маршрут / точки";
"tactical.map.legend.route_geometry" = "Геометрия миссии";
"tactical.map.legend.predicted_path" = "Прогнозируемая траектория";
"tactical.map.legend.launch_corridor" = "Стартовый коридор";
"tactical.map.legend.safe_return" = "Контур безопасного возврата";
"tactical.map.legend.drop_zone" = "Зона сброса";
"tactical.map.legend.no_fly" = "Запретная зона";
"tactical.map.legend.payload_impact" = "Маркер impact event";
"tactical.map.overlay.payload_impact" = "Событие контакта";
"tactical.map.overlay.payload_on_target" = "Контакт в целевой зоне";
"tactical.map.overlay.payload_near_target" = "Контакт рядом с целью";
"tactical.map.overlay.payload_off_target" = "Контакт вне цели";
"tactical.map.overlay.boundary" = "Граница";
"tactical.map.overlay.safe_return" = "Безопасный возврат";
"tactical.map.overlay.link" = "Связь";
"tactical.map.overlay.drop_zone_radius" = "Зона сброса";
"tactical.map.overlay.no_fly" = "No-Fly";
"tactical.map.route.empty" = "Черновик маршрута пуст.";
"tactical.map.badge.draft_dirty" = "ЧЕРНОВИК ИЗМЕНЁН";
"tactical.map.badge.draft_synced" = "ЧЕРНОВИК СОХРАНЁН";
"tactical.map.section.launch" = "ЗАПУСК";
"tactical.map.launch.mode" = "РЕЖИМ";
"tactical.map.launch.object" = "ОБЪЕКТ";
"tactical.map.launch.position" = "ПОЗИЦИЯ";
"tactical.map.launch.heading" = "КУРС";
"tactical.map.launch.standard_hint" = "Standard сохраняет текущий legacy-старт. Выберите отдельный launch mode, чтобы использовать стартовый объект и защищённый initial climb.";
"tactical.map.launch.place_object_hint" = "Выберите нестандартный режим запуска, затем поставьте стартовый объект на карте и задайте его курс.";
"tactical.map.launch.mode.standard" = "Standard";
"tactical.map.launch.mode.handLaunch" = "Hand Launch";
"tactical.map.launch.mode.catapult" = "Catapult";
"tactical.map.launch.mode.runway" = "Runway";
"tactical.map.launch.mode.vtol" = "VTOL";
"tactical.map.launch.object.handLaunchPoint" = "Точка ручного запуска";
"tactical.map.launch.object.catapultLine" = "Линия катапульты";
"tactical.map.launch.object.runwayStrip" = "Полоса разбега";
"tactical.map.launch.object.vtolStartPoint" = "Точка VTOL-старта";
"tactical.map.action.clear_launch_object" = "Очистить Старт";
"tactical.map.action.save_draft" = "СОХРАНИТЬ";
"tactical.map.action.cancel" = "ОТМЕНИТЬ";
"tactical.map.action.exit" = "ВЫЙТИ";
"tactical.map.action.remove_last_waypoint" = "УДАЛИТЬ ПОСЛЕДНЮЮ ТОЧКУ";
"tactical.map.action.clear_route" = "ОЧИСТИТЬ МАРШРУТ";
"tactical.map.action.clear_zones" = "ОЧИСТИТЬ ЗОНЫ";
"tactical.map.status.empty.title" = "Черновик пуст";
"tactical.map.status.empty.detail" = "Добавьте хотя бы одну точку маршрута, чтобы построить preview.";
"tactical.map.status.preview_unavailable.title" = "Preview недоступен";
"tactical.map.status.preview_unavailable.detail" = "Черновик ещё не готов. Карта не публикует preview-маршрут.";
"tactical.map.status.invalid.title" = "Черновик невалиден";
"tactical.map.status.invalid.detail" = "В черновике есть блокирующие ошибки. Маршрут не сохранён.";
"tactical.map.status.ready.title" = "Preview готов";
"tactical.map.status.ready.detail" = "Черновик структурно корректен. Preview маршрута и зоны готовы к проверке оператором.";
"tactical.map.issue.none" = "Блокирующих проблем нет.";
"tactical.map.issue.route_missing" = "Добавьте хотя бы одну точку маршрута перед сохранением черновика.";
"tactical.map.issue.waypoint_out_of_bounds" = "Одна или несколько точек находятся вне технических границ мира.";
"tactical.map.issue.waypoint_spacing" = "Соседние точки маршрута расположены слишком близко друг к другу.";
"tactical.map.issue.zone_radius_invalid" = "Радиус одной из зон выходит за допустимый инженерный диапазон.";
"tactical.map.issue.zone_out_of_bounds" = "Одна или несколько зон выходят за технические границы мира.";
"tactical.map.issue.route_intersects_no_fly" = "Маршрут миссии пересекает хотя бы одну запретную зону.";
"tactical.map.issue.invalid_altitude_window" = "Ограничения по высоте заданы некорректно: минимальная высота не должна превышать максимальную.";
"tactical.map.issue.target_altitude_out_of_range" = "Расчётная высота выполнения миссии выходит за заданный диапазон.";
"tactical.map.issue.invalid_speed_window" = "Ограничения по скорости заданы некорректно или выходят за возможности текущего БЛА.";
"tactical.map.issue.route_exceeds_safe_return" = "Маршрут вместе с безопасным возвратом превышает текущий безопасный запас дальности.";
"tactical.map.issue.route_margin_tight" = "Маршрут оставляет слишком маленький резерв на безопасный возврат.";
"tactical.map.issue.route_exceeds_operational_radius" = "Маршрут выходит за рекомендуемый рабочий радиус выбранного БЛА.";
"tactical.map.issue.link_degraded" = "Маршрут заходит в зону деградации связи.";
"tactical.map.issue.launch_object_required" = "Для выбранного режима запуска нужен стартовый объект на tactical map.";
"tactical.map.issue.launch_object_out_of_bounds" = "Стартовый объект находится вне текущих границ tactical map.";
"tactical.map.issue.launch_object_conflicts_no_fly" = "Стартовый объект или его коридор конфликтует с no-fly зоной.";
"tactical.map.issue.launch_corridor_invalid" = "Стартовый коридор слишком рано выходит за пределы миссии или сразу пересекает границу.";
"tactical.map.issue.launch_space_insufficient" = "Для выбранной семантики запуска вокруг стартового объекта недостаточно прямого пространства.";
"tactical.map.issue.map_tight" = "Текущий размер карты тесен для выбранного профиля БЛА.";
"tactical.map.issue.map_unsuitable" = "Текущий размер карты не подходит выбранному профилю БЛА.";
"mission.plan.status.draft" = "Черновик";
"mission.plan.status.invalid" = "Невалидно";
"mission.plan.status.ready" = "Готово";
"mission.plan.status.validated" = "Валидирован";
"mission.binding.status.unbound" = "Не привязан";
"mission.binding.status.bound" = "Привязан";
"mission.binding.status.failed" = "Сбой";
"mission.execution.readiness.draft" = "Черновик";
"mission.execution.readiness.validated" = "Валидирован";
"mission.execution.readiness.unbound" = "Не привязан";
"mission.execution.readiness.ready" = "Готов";
"mission.execution.readiness.failed" = "Сбой привящки";
"mission.readiness.draft" = "Черновик";
"mission.readiness.invalid" = "Невалидно";
"mission.readiness.blocked" = "Блок";
"mission.readiness.ready" = "Готов";
"mission.execution.status.idle" = "Ожидание";
"mission.execution.status.ready" = "Подготовлено";
"mission.execution.status.running" = "Выполняется";
"mission.execution.status.paused" = "Пауза";
"mission.execution.status.completed" = "Завершено";
"mission.execution.status.aborted" = "Прервано";
"mission.execution.status.blocked" = "Заблокировано";
"mission.execution.status.failed" = "Сбой";
"mission.execution.status.no_authority" = "Нет прав";
"mission.truth.status.draft" = "Черновик";
"mission.truth.status.invalid" = "Невалидно";
"mission.truth.status.validated" = "Валидирован";
"mission.truth.status.execution_unbound" = "Нет контура";
"mission.truth.status.blocked" = "Блок";
"mission.truth.status.ready" = "Готово";
"mission.truth.status.running" = "Выполняется";
"mission.truth.status.paused" = "Пауза";
"mission.truth.status.returning_home" = "Возврат";
"mission.truth.status.completed" = "Завершено";
"mission.truth.status.aborted" = "Прервано";
"mission.truth.status.failed" = "Сбой";
"mission.truth.status.no_authority" = "Нет прав";
"mission.truth.status.no_target" = "Нет цели";
"mission.truth.status.route_invalid" = "Маршрут";
"mission.truth.status.runtime_distance_unavailable" = "Нет дистанции";
"mission.truth.status.failed_binding" = "Неудачная привязка";
"mission.truth.status.runtime_unsafe" = "Небезопасно";
"mission.failsafe.none" = "Нет";
"mission.failsafe.hold" = "Держать";
"mission.failsafe.pause" = "Пауза";
"mission.failsafe.abort" = "Разорвать";
"mission.failsafe.return_home" = "Возврат";
"mission.status.reason.draft_empty" = "Черновик миссии пуст.";
"mission.status.reason.no_validated_plan" = "Валидный план миссии отсутствует.";
"mission.status.reason.preview_unavailable" = "Предпросмотр маршрута недоступен. План миссии пока нельзя подготовить.";
"mission.status.reason.route_missing" = "В миссии нет точек маршрута.";
"mission.status.reason.route_invalid" = "Маршрут миссии содержит невалидные или нулевые сегменты.";
"mission.status.reason.zone_invalid" = "Одна или несколько зон миссии невалидны.";
"mission.status.reason.plan_not_prepared" = "Черновик сохранён, но контур выполнения ещё не подготовлен.";
"mission.status.reason.plan_not_ready" = "План миссии не готов к запуску.";
"mission.status.reason.execution_contour_missing" = "Валидный план миссии есть, но контур выполнения ещё не собран.";
"mission.status.reason.execution_binding_failed" = "План миссии валидный, но привязка выполнения завершена с ошибкой.";
"mission.status.reason.execution_not_started" = "План подготовлен и ждёт команды выполнения.";
"mission.status.reason.invalid_altitude_window" = "Ограничения миссии по высоте заданы некорректно.";
"mission.status.reason.invalid_speed_window" = "Ограничения миссии по скорости заданы некорректно.";
"mission.status.reason.target_altitude_out_of_range" = "Высота выполнения миссии выходит за заданный диапазон.";
"mission.status.reason.altitude_constraints_applied" = "Ограничения по высоте приняты и применяются к расчётной высоте выполнения миссии.";
"mission.status.reason.speed_max_constraint_applied" = "Максимальная скорость миссии принята и применяется через масштабирование команд автопилота.";
"mission.status.reason.speed_min_constraint_advisory" = "Минимальная скорость миссии принята как рекомендации, но исходный-автопилот пока не гарантирует её строго на каждом контуре.";
"mission.status.reason.no_active_execution_target" = "Контур выполнения есть, но активная цель миссия не назначена.";
"mission.status.reason.no_mission_target" = "Слой миссии не имеет активной цели для передачи в автопилот.";
"mission.status.reason.runtime_distance_unavailable" = "Контур выполнения есть, но расстояние до активной цели недоступна.";
"mission.status.reason.no_target_bound" = "Во время выполнения миссии нет активной цели, привязанной к автопилоту.";
"mission.status.reason.no_control_authority" = "Цель миссии привязана, но текущий контур автопилота не владеет органом управления.";
"mission.status.reason.authority_flap_detected" = "Управление кратковременно потеряно и восстановлено. Выполнение продолжается.";
"mission.status.reason.runtime_stall_detected" = "Прогресс миссии не меняется слишком долго.";
"mission.status.reason.battery_unsafe" = "Батарея/резерв времени работы недостаточен для безопасного продолжения миссии.";
"mission.status.reason.route_exceeds_safe_return" = "Маршрут миссии вместе с возвратом превышает текущий безопасный запас дальности.";
"mission.status.reason.route_margin_tight" = "Маршрут миссии оставляет слишком маленький резерв на безопасный возврат.";
"mission.status.reason.route_exceeds_operational_radius" = "Маршрут миссии выходит за рекомендуемый рабочий радиус.";
"mission.status.reason.link_degraded" = "Маршрут миссии заходит в зону деградации связи.";
"mission.status.reason.map_tight" = "Текущий размер карты тесен для выбранного профиля БЛА.";
"mission.status.reason.map_unsuitable" = "Текущий размер карты не подходит выбранному профилю БЛА.";
"mission.status.reason.mission_start_blocked" = "Старт миссии заблокирован текущим уровнем безопасности или временем работы.";
"mission.status.reason.mission_aborted_by_safety" = "Миссия прервана контролем безопасности.";
"mission.status.reason.mission_paused_by_operator" = "Миссия поставлена на паузу оператором.";
"mission.status.reason.mission_paused_by_runtime" = "Миссия поставлена на паузу временем выполнения.";
"mission.status.reason.return_home_triggered" = "Выполнение миссии остановлено, запущен возврат домой.";
"mission.status.reason.runtime_unsafe" = "Время выполнения признано небезопасным для выполнения миссии.";
"mission.status.reason.unknown_runtime_mismatch" = "Слой миссии и контур автопилота не согласованы.";
"mission.status.reason.execution_blocked" = "Миссию нельзя запустить или возобновить, пока БЛА не сможет принять target-marker auto-navigation.";
"mission.status.reason.waypoint_reached" = "Точка достигнута. Переключаемся на следующую цель.";
"mission.status.reason.mission_paused" = "Миссия поставлена на паузу. Текущая цель сохранена, но guidance не выполняется.";
"mission.status.reason.mission_completed" = "Миссия завершена. Все точки достигнуты.";
"mission.status.reason.mission_aborted" = "Миссия прервана оператором.";
"mission.status.reason.mission_failed" = "Миссия завершилась с ошибкой.";
"mission.status.field.control" = "КОНТУР";
"mission.status.field.active_target" = "ЦЕЛЬ";
"mission.status.field.distance" = "ДИСТ";
"mission.status.field.progress" = "ПРОГРЕСС";
"mission.status.field.plan" = "ПЛАН";
"mission.status.field.execution" = "ВЫПОЛНЕНИЕ";
"fixed_wing.assist.mode" = "ASSIST";
"fixed_wing.assist.target" = "ЦЕЛЬ";
"fixed_wing.assist.status" = "СТАТУС";
"fixed_wing.assist.feasibility" = "ГЕОМЕТРИЯ ПЕРЕХВАТА";
"fixed_wing.assist.active_waypoint" = "АКТИВНАЯ ТОЧКА";
"fixed_wing.assist.auto_advance" = "Auto-advance to next waypoint";
"fixed_wing.assist.waypoint_mode" = "РЕЖИМ ТОЧКИ";
"fixed_wing.assist.waypoint_mode.fly_by" = "Fly-by";
"fixed_wing.assist.auto_advance.status.paused_poor_geometry" = "Автопереход приостановлен: плохая геометрия следующей точки";
"fixed_wing.assist.auto_advance.status.paused_obstacle_ahead" = "Автопереход приостановлен: препятствие впереди";
"fixed_wing.assist.waypoint.none" = "Точка не выбрана";
"fixed_wing.assist.action.previous" = "ПРЕДЫДУЩАЯ";
"fixed_wing.assist.action.next" = "СЛЕДУЮЩАЯ";
"fixed_wing.assist.action.intercept_selected" = "ПЕРЕХВАТИТЬ ВЫБРАННУЮ";
"fixed_wing.assist.state.single_point_intercept" = "ПЕРЕХВАТ ОДНОЙ ТОЧКИ";
"fixed_wing.assist.state.inbound_leg_track" = "ВЕДЕНИЕ ПО ВХОДЯЩЕМУ LEG";
"fixed_wing.assist.state.flyby_turn_transition" = "ПЕРЕХОД FLY-BY TURN";
"fixed_wing.assist.state.outbound_leg_track" = "ВЕДЕНИЕ ПО ИСХОДЯЩЕМУ LEG";
"fixed_wing.assist.state.terminal_capture" = "ТЕРМИНАЛЬНЫЙ ЗАХВАТ";
"fixed_wing.assist.state.route_complete" = "МАРШРУТ ЗАВЕРШЕН";
"fixed_wing.assist.state.auto_advance_paused_poor_geometry" = "АВТОПЕРЕХОД ПРИОСТАНОВЛЕН (ГЕОМЕТРИЯ)";
"fixed_wing.assist.state.auto_advance_paused_obstacle" = "АВТОПЕРЕХОД ПРИОСТАНОВЛЕН (ПРЕПЯТСТВИЕ)";
"fixed_wing.assist.feasibility.feasible" = "Выполнима";
"fixed_wing.assist.feasibility.tight_turn" = "Тесный поворот";
"fixed_wing.assist.feasibility.poor_geometry" = "Плохая геометрия";
"fixed_wing.assist.feasibility.warning" = "Угол поворота вблизи точки превышает безопасный крен. Автопилот плавно срежет угол, чтобы не сорваться в скольжение.";
"fixed_wing.assist.hint" = "Автопилот плавно ведёт самолёт по точкам через виртуальную «точку прицеливания» (carrot pursuit). Чем угловатее маршрут, тем шире будут радиусы поворота.";
"fixed_wing.assist.debug.active_index" = "activeWaypointIndex";
"fixed_wing.assist.debug.auto_advance_enabled" = "autoAdvanceEnabled";
"fixed_wing.assist.debug.next_index" = "nextWaypointIndex";
"fixed_wing.assist.debug.has_prev_waypoint" = "hasPrevWaypoint";
"fixed_wing.assist.debug.has_next_waypoint" = "hasNextWaypoint";
"fixed_wing.assist.debug.is_penultimate_waypoint" = "isPenultimateWaypoint";
"fixed_wing.assist.debug.is_final_waypoint" = "isFinalWaypoint";
"fixed_wing.assist.debug.flyby_center_waypoint_index" = "flyByCenterWaypointIndex";
"fixed_wing.assist.debug.active_triple_indices" = "activeTripleIndices";
"fixed_wing.assist.debug.active_id" = "activeWaypointID";
"fixed_wing.assist.debug.captured_ids" = "capturedWaypointIDs";
"fixed_wing.assist.debug.intercept_state" = "interceptState";
"fixed_wing.assist.debug.capture_completed_reason" = "captureCompletedReason";
"fixed_wing.assist.debug.feasibility" = "interceptFeasibilityState";
"fixed_wing.assist.debug.distance" = "distanceToActiveWaypoint";
"fixed_wing.assist.debug.heading_error" = "headingErrorDeg";
"fixed_wing.assist.debug.raw_heading_error" = "rawHeadingErrorDeg";
"fixed_wing.assist.debug.turn_radius" = "estimatedTurnRadius";
"fixed_wing.assist.debug.commanded_bank" = "bankCommandDeg";
"fixed_wing.assist.debug.filtered_bank" = "filteredBankCommandDeg";
"fixed_wing.assist.debug.turn_direction" = "commandedTurnDirection";
"fixed_wing.assist.debug.transition_reason" = "stateTransitionReason";
"fixed_wing.assist.debug.auto_advance_suppressed" = "autoAdvanceSuppressed";
"fixed_wing.assist.debug.auto_advance_suppressed_reason" = "autoAdvanceSuppressedReason";
"fixed_wing.assist.debug.heading_error_to_next_waypoint" = "headingErrorToNextWaypoint";
"fixed_wing.assist.debug.next_waypoint_in_forward_sector" = "nextWaypointInForwardSector";
"fixed_wing.assist.debug.enough_turn_in_distance" = "enoughTurnInDistance";
"fixed_wing.assist.debug.collision_risk_to_next_waypoint" = "collisionRiskToNextWaypoint";
"fixed_wing.assist.debug.obstacle_in_turn_corridor" = "obstacleInTurnCorridor";
"fixed_wing.assist.debug.blocked_path_to_next_waypoint" = "blockedPathToNextWaypoint";
"fixed_wing.assist.debug.lateral_guidance_suppressed_for_poor_geometry" = "lateralGuidanceSuppressedForPoorGeometry";
"fixed_wing.assist.debug.current_leg_start" = "currentLegStart";
"fixed_wing.assist.debug.current_leg_middle" = "currentLegMiddle";
"fixed_wing.assist.debug.current_leg_end" = "currentLegEnd";
"fixed_wing.assist.debug.inbound_course_deg" = "inboundCourseDeg";
"fixed_wing.assist.debug.outbound_course_deg" = "outboundCourseDeg";
"fixed_wing.assist.debug.course_change_deg" = "courseChangeDeg";
"fixed_wing.assist.debug.lead_distance" = "leadDistance";
"fixed_wing.assist.debug.flyby_transition_active" = "flyByTransitionActive";
"fixed_wing.assist.debug.turn_transition_active" = "turnTransitionActive";
"fixed_wing.assist.debug.flyby_transition_feasible" = "flyByTransitionFeasible";
"fixed_wing.assist.debug.active_guidance_mode" = "activeGuidanceMode";
"fixed_wing.assist.debug.preview_uses_cached_flyby_plan" = "previewUsesCachedFlyByPlan";
"fixed_wing.assist.debug.controller_uses_cached_flyby_plan" = "controllerUsesCachedFlyByPlan";
"fixed_wing.assist.debug.guidance_direct_to_waypoint_suppressed" = "guidanceDirectToWaypointSuppressed";
"fixed_wing.assist.debug.terminal_capture_allowed" = "terminalCaptureAllowed";
"fixed_wing.assist.debug.guidance_type" = "activeGuidanceTargetType";
"fixed_wing.assist.debug.using_obsolete_fixed_wing_mode" = "usingObsoleteFixedWingMode";
"fixed_wing.assist.debug.flyby_plan_recompute_count" = "flyByPlanRecomputeCount";
"fixed_wing.assist.debug.full_route_rebuild_count" = "fullRouteRebuildCount";
"fixed_wing.assist.debug.overlay_rebuild_count" = "overlayRebuildCount";
"fixed_wing.assist.debug.guidance_recompute_count" = "guidanceRecomputeCount";
"fixed_wing.assist.debug.frame_time" = "frameTimeMs";
"fixed_wing.assist.debug.heavy_map_rebuild_count" = "heavyMapRebuildCount";
"fixed_wing.assist.debug.frame_time_during_transition" = "frameTimeMsDuringTransition";
"mission.status.field.validated_plan" = "ВАЛИДИРОВАНО";
"mission.status.field.binding" = "БИНД";
"mission.status.field.execution_contour" = "CONTOUR";
"mission.status.field.execution_target" = "TARGET SRC";
"mission.status.field.runtime_distance" = "DIST SRC";
"mission.status.field.start_permission" = "START";
"mission.status.field.link" = "ЛИНК";
"mission.status.field.remaining_range" = "ДАЛЬН";
"mission.status.field.safe_return" = "ВОЗВРАТ";
"mission.status.field.map_scale" = "КАРТА";
"mission.status.field.truth" = "TRUTH";
"mission.status.field.readiness" = "ГОТОВНОСТЬ";
"mission.status.field.authority_state" = "AUTH";
"mission.status.field.failsafe" = "ОТКАЗОУСТОЙЧИВЫЙ";
"mission.status.field.mission_status" = "МИССИЯ";
"mission.status.field.mission_type" = "ТИП";
"mission.status.field.waypoint_count" = "ТОЧКИ";
"mission.status.field.route_length" = "ДЛИНА";
"mission.status.field.drop_zone" = "СБРОС";
"mission.status.field.no_fly_status" = "NO-FLY";
"mission.status.field.link_quality" = "КАЧЕСТВО СВЯЗИ";
"mission.status.field.home_distance" = "ДО HOME";
"mission.status.field.edge_distance" = "ДО КРАЯ";
"mission.status.field.safe_return_state" = "ВОЗВРАТ";
"mission.status.field.validation" = "ПРОВЕРКА";
"mission.status.field.map_scale_active" = "МАСШТАБ КАРТЫ";
"mission.status.field.profile" = "ПРОФИЛЬ";
"mission.status.field.feasibility" = "ВЫПОЛНИМОСТЬ";
"mission.status.field.primary_issue" = "ОСНОВНАЯ ПРОБЛЕМА";
"mission.status.value.present" = "Есть";
"mission.status.value.absent" = "Нет";
"mission.status.value.bound" = "Да";
"mission.status.value.unbound" = "Нет";
"mission.status.value.available" = "Есть";
"mission.status.value.unavailable" = "Нет";
"mission.status.value.granted" = "Да";
"mission.status.value.blocked" = "Блок";
"mission.status.value.none" = "Нет";
"mission.status.value.route" = "Маршрут";
"mission.status.value.delivery" = "Сброс";
"mission.status.value.route_restricted" = "Маршрут с ограничениями";
"mission.status.value.delivery_restricted" = "Сброс с ограничениями";
"mission.status.value.zone_count" = "%d зон";
"mission.status.value.issue_count" = "%d проблем";
"mission.status.value.validated" = "Валидирован";
"mission.status.value.feasible" = "Выполнима";
"mission.status.value.limited" = "С ограничениями";
"mission.status.chip.prepare" = "ПОДГОТОВКА";
"mission.status.chip.start" = "СТАРТ";
"mission.status.chip.bound" = "СВЯЗАННЫЙ";
"mission.status.chip.failsafe" = "БЕЗОПАСНО";
"mission.authority.state.idle" = "Не требуется";
"mission.authority.state.mission" = "Заказчик";
"mission.authority.state.flap" = "Проблема с органом управления";
"mission.authority.state.target_lost" = "Цель потеряна";
"mission.authority.state.lost" = "Потеря органа исполнения";
"mission.panel.section.status" = "СТАТУС МИССИИ";
"mission.panel.section.constraints" = "ОГРАНИЧЕНИЯ МИССИИ";
"mission.panel.section.execution" = "ВЫПОЛНЕНИЕ МИССИИ";
"mission.constraints.altitude.minimum" = "Минимальная высота";
"mission.constraints.altitude.maximum" = "Максимальная высота";
"mission.constraints.speed.minimum" = "Минимальная скорость";
"mission.constraints.speed.maximum" = "Максимальная скорость";
"mission.constraints.unit.meters" = "м";
"mission.constraints.unit.speed" = "м/с";
"mission.constraints.hint" = "Ограничения живут в состоянии миссии, валидируются перед запуском и передаются в слой автопилота там, где это поддерживает текущий базисный коньур.";
"mission.panel.plan.summary" = "%d точек | %d точек маршрута";
"mission.panel.plan.empty" = "План миссии не подготовлен.";
"mission.panel.action.prepare" = "ПОДГОТОВИТЬ МИССИЮ";
"mission.panel.action.start" = "СТАРТ";
"mission.panel.action.pause" = "ПАУЗА";
"mission.panel.action.resume" = "ПРОДОЛЖИТЬ";
"mission.panel.action.abort" = "ПРЕРВАТЬ";
"module.diagnostics.mission" = "КОНТУР МИССИИ";
"module.diagnostics.mission.subtitle" = "Правдивость, безопасность, орган управления и надежность.";
"module.diagnostics.mission_history" = "ТАЙМЛАЙН МИССИИ";
"module.diagnostics.mission_history.subtitle" = "Структурированный журнал событий и подведение итогов после полета по текущей миссии.";
"mission.event.category.planning" = "ПЛАН";
"mission.event.category.operator" = "ОПЕРАТОР";
"mission.event.category.execution" = "ВЫПОЛНЕНИЯ";
"mission.event.category.safety" = "БЕЗОПАСНОСТЬ";
"mission.event.category.failsafe" = "НАДЕЖНОСТЬ";
"mission.event.category.payload" = "ПОЛЕЗНАЯ НАГРУЗКА";
"mission.event.category.diagnostics" = "ДИАГНОСТИКА";
"mission.event.severity.info" = "ИНФО";
"mission.event.severity.warning" = "ОПАСНОСТЬ";
"mission.event.severity.critical" = "КРИТИЧЕСКИ";
"mission.event.code.missionDraftPrepared" = "ЧЕРНОВИК ГОТОВ";
"mission.event.code.missionValidated" = "МИССИЯ ВАЛИДИРОВАНА";
"mission.event.code.missionStartRequested" = "ЗАПРОС СТАРТА";
"mission.event.code.missionStarted" = "МИССИЯ ЗАПУЩЕНА";
"mission.event.code.controlAuthorityGranted" = "ОРГАН УПРАВЛЕНИЯ: OK";
"mission.event.code.controlAuthorityLost" = "ПОТЕРЯ ОРГАНА УПРАВЛЕНИЯ";
"mission.event.code.controlAuthorityFlap" = "КОНФЛИКТ ОРГАНА УПРАВЛЕНИЯ ";
"mission.event.code.waypointActivated" = "АКТИВНАЯ ТОЧКА";
"mission.event.code.waypointReached" = "ТОЧКА ДОСТИГНУТА";
"mission.event.code.segmentCompleted" = "СЕГМЕНТ ЗАВЕРШЁН";
"mission.event.code.missionPaused" = "МИССИЯ НА ПАУЗЕ";
"mission.event.code.missionResumed" = "МИССИЯ ПРОДОЛЖЕНА";
"mission.event.code.missionBlocked" = "МИССИЯ ЗАБЛОКИРОВАНА";
"mission.event.code.missionWarningRaised" = "ПРЕДУПРЕЖДЕНИЕ";
"mission.event.code.runtimeUnsafeDetected" = "НЕБЕЗОПАСНО ПРИ ВЫПОЛНЕНИИ";
"mission.event.code.failsafeTriggered" = "НАДЕЖНОСТЬ";
"mission.event.code.returnHomeTriggered" = "ВОЗВРАТ ДОМОЙ";
"mission.event.code.missionAborted" = "МИССИЯ ПРЕРВАНА";
"mission.event.code.missionCompleted" = "МИССИЯ ЗАВЕРШЕНА";
"mission.event.code.debriefGenerated" = "ПОДВЕДЕНИЕ ИТОГОВ ГОТОВО";
"mission.event.code.payloadActionTriggered" = "ДЕЙСТВИЕ ПОЛЕЗНОЙ НАГРУЗКИ";
"mission.event.code.payloadActionCompleted" = "ПОЛЕЗНАЯ НАГРУЗКА ЗАВЕРШЕНА";
"mission.event.code.diagnosticsCritical" = "КРИТИЧЕСКАЯ ДИАГНОСТИКА";
"mission.event.detail.missionDraftPrepared" = "Черновик миссии подготовлен к проверке execution.";
"mission.event.detail.missionValidated" = "План миссии прошёл валидацию и готов к подготовке execution.";
"mission.event.detail.missionStartRequested" = "Оператор запросил старт миссии.";
"mission.event.detail.missionStarted" = "Выполнение миссии";
"mission.event.detail.controlAuthorityGranted" = "Слой миссии владеет орган управления над контуром автопилота.";
"mission.event.detail.controlAuthorityFlap" = "Орган управления кратко пропал и восстановился в пределах отсрочки.";
"mission.event.detail.controlAuthorityLost" = "Слой миссии потерял орган управления и больше не гарантирует выполнение.";
"mission.event.detail.waypointActivated" = "Новая точка маршрута стала активной целью.";
"mission.event.detail.waypointReached" = "Активная точка маршрута достигнута.";
"mission.event.detail.segmentCompleted" = "Текущий сегмент маршрута завершён.";
"mission.event.detail.missionPaused" = "Выполнение миссии переведено в паузу.";
"mission.event.detail.missionResumed" = "Выполнение миссии продолжено после паузы.";
"mission.event.detail.missionBlocked" = "Выполнение миссии заблокировано текущим временем выполнения или состоянием безопасности.";
"mission.event.detail.missionWarningRaised" = "Runtime safety layer опубликовал предупреждение миссии.";
"mission.event.detail.runtimeUnsafeDetected" = "Mission runtime признан небезопасным.";
"mission.event.detail.failsafeTriggered" = "Failsafe coordinator перевёл миссию в безопасную ветку.";
"mission.event.detail.returnHomeTriggered" = "Mission execution передан в return-home.";
"mission.event.detail.missionAborted" = "Mission execution был прерван.";
"mission.event.detail.missionCompleted" = "Mission execution завершил все активные точки.";
"mission.event.detail.debriefGenerated" = "По итоговому runtime состоянию сформирован mission debrief.";
"mission.event.detail.payloadActionTriggered" = "Запущено payload-действие миссии.";
"mission.event.detail.payloadActionCompleted" = "Payload-действие миссии завершено.";
"mission.event.detail.diagnosticsCritical" = "Критический diagnostics-инцидент привязан к mission timeline.";
"mission.timeline.title" = "ТАЙМЛАЙН МИССИИ";
"mission.timeline.empty" = "Таймлайн миссии пока отсутствует.";
"mission.timeline.empty.filtered" = "Событий, подходящих под текущий фильтр, нет.";
"mission.timeline.metric.events" = "СОБЫТИЯ";
"mission.timeline.metric.warnings" = "WARN";
"mission.timeline.metric.critical" = "CRIT";
"mission.timeline.filter.severity" = "SEVERITY";
"mission.timeline.filter.category" = "CATEGORY";
"mission.timeline.filter.severity.all" = "ВСЕ";
"mission.timeline.filter.severity.info" = "INFO";
"mission.timeline.filter.severity.warning" = "WARN";
"mission.timeline.filter.severity.critical" = "CRIT";
"mission.timeline.filter.category.all" = "ВСЕ";
"mission.debrief.title" = "DEBRIEF МИССИИ";
"mission.debrief.empty" = "Готовый debrief по завершённой миссии отсутствует.";
"mission.debrief.metric.duration" = "ДЛИТ.";
"mission.debrief.metric.route" = "МАРШРУТ";
"mission.debrief.metric.progress" = "ПРОГРЕСС";
"mission.debrief.metric.energy" = "БАТАРЕЯ";
"mission.debrief.metric.warnings" = "WARNINGS";
"mission.debrief.metric.critical" = "CRITICAL";
"mission.debrief.type.route" = "Маршрутная миссия";
"mission.debrief.type.delivery" = "Миссия доставки";
"mission.debrief.type.constrained" = "Миссия с ограничениями";
"mission.debrief.verdict.success" = "Миссия завершена по плану.";
"mission.debrief.verdict.partial_success" = "Миссия завершена частично или с деградацией.";
"mission.debrief.verdict.aborted" = "Миссия прервана оператором.";
"mission.debrief.verdict.failed" = "Миссия завершилась с отказом.";
"mission.debrief.verdict.returned_home" = "Миссия остановлена и переведена в возврат домой.";
"mission.debrief.verdict.safety_terminated" = "Миссия остановлена safety-логикой.";
"mission.outcome.success" = "УСПЕХ";
"mission.outcome.partial_success" = "ЧАСТИЧНО";
"mission.outcome.aborted" = "ПРЕРВАНО";
"mission.outcome.failed" = "СБОЙ";
"mission.outcome.returned_home" = "ВОЗВРАТ";
"mission.outcome.safety_terminated" = "SAFETY";
"tactical.map.legend.toggle" = "Легенда карты";
"tactical.map.pan.center" = "Центрировать карту";

// CAD Design Workshop module
"module.design_workshop.title" = "МАСТЕРСКАЯ";
"module.design_workshop.toolbar_title" = "Мастерская";
"module.design_workshop.subtitle" = "Параметрическое конструирование компонентов БЛА";

// CAD asset kinds
"cad.kind.basic_wing" = "Крыло";
"cad.kind.frame_plate" = "Пластина рамы";
"cad.kind.beam" = "Балка";
"cad.kind.tube" = "Труба";
"cad.kind.mount_bracket" = "Кронштейн";
"cad.kind.payload_box" = "Отсек нагрузки";
"cad.kind.sketch" = "Эскиз";

// CAD materials
"cad.material.plastic" = "Пластик";
"cad.material.carbon_fiber" = "Карбон";
"cad.material.aluminum" = "Алюминий";
"cad.material.steel" = "Сталь";
"cad.material.composite" = "Композит";

// CAD attachment roles
"cad.role.frame" = "Рама";
"cad.role.wing" = "Крыло";
"cad.role.payload" = "Нагрузка";
"cad.role.camera" = "Камера";
"cad.role.sensor" = "Сенсор";
"cad.role.landing_gear" = "Шасси";
"cad.role.motor" = "Мотор";
"cad.role.battery" = "Аккумулятор";
"cad.role.antenna" = "Антенна";
"cad.role.generic" = "Общий";

// CAD document
"cad.document.default_name" = "Новый документ";

// CAD UI sections and actions
"cad.section.create" = "Создать элемент";
"cad.section.dimensions" = "Размеры";
"cad.section.material" = "Материал";
"cad.section.mass_info" = "Масса и габариты";
"cad.section.sketch" = "Эскиз";
"cad.section.sketch_line_create" = "Новая линия";
"cad.section.sketch_lines" = "Линии эскиза";
"cad.action.clear_all" = "Очистить всё";
"cad.action.delete" = "Удалить";
"cad.action.duplicate" = "Дублировать";
"cad.asset.copy_suffix" = "копия";
"cad.asset.unnamed" = "Безымянный элемент";

// CAD metrics
"cad.metric.mass" = "Масса";
"cad.metric.material" = "Материал";
"cad.metric.bounding" = "Габариты";
"cad.metric.attach_pts" = "Точки крепления";

// CAD parameters
"cad.param.span" = "Размах";
"cad.param.root_chord" = "Корневая хорда";
"cad.param.tip_chord" = "Концевая хорда";
"cad.param.thickness" = "Толщина";
"cad.param.sweep" = "Стреловидность";
"cad.param.dihedral" = "Поперечное V";
"cad.param.width" = "Ширина";
"cad.param.depth" = "Глубина";
"cad.param.height" = "Высота";
"cad.param.length" = "Длина";
"cad.param.outer_radius" = "Внешний радиус";
"cad.param.inner_radius" = "Внутренний радиус";
"cad.param.plate_width" = "Ширина пластины";
"cad.param.plate_depth" = "Глубина пластины";
"cad.param.plate_thickness" = "Толщина пластины";
"cad.param.arm_length" = "Длина стойки";
"cad.param.arm_thickness" = "Толщина стойки";

// CAD states
"cad.assets.empty" = "Нет элементов. Создайте первый компонент выше.";
"cad.selection.empty" = "Выберите элемент из списка или создайте новый.";
"cad.selection.empty_hint" = "Создайте крыло, пластину рамы, балку, трубу, кронштейн или отсек нагрузки.";
"cad.assets.empty_short" = "Нет элементов";
"cad.assets.empty_hint" = "Создайте первый элемент выше.";
"cad.mass.no_selection" = "Нет выбранного элемента";

// CAD Workshop workspace
"cad.workspace.title" = "Мастерская проектирования";
"cad.workspace.back_to_simulation" = "Симуляция";
"cad.workspace.open" = "Мастерская";
"cad.section.elements" = "Элементы";
"cad.section.identity" = "Идентификация";
"cad.field.name" = "Название";
"cad.section.transform" = "Трансформация";
"cad.transform.position" = "Позиция";
"cad.transform.rotation" = "Поворот";
"cad.section.attachment_points" = "Точки крепления";
"cad.attachment.count" = "%d точек";
"cad.attachment.show" = "Показывать точки крепления";
"cad.attachment.add_short" = "Точка";
"cad.attachment.add" = "Добавить точку";
"cad.attachment.custom_base" = "Точка крепления";
"cad.attachment.reset_system" = "Сбросить системные точки";
"cad.attachment.empty" = "У элемента пока нет точек крепления.";
"cad.attachment.no_selection" = "Выберите точку крепления для редактирования.";
"cad.attachment.system" = "системная";
"cad.attachment.custom" = "пользовательская";
"cad.attachment.enabled" = "Включена";
"cad.attachment.role" = "Роль";
"cad.attachment.delete" = "Удалить точку";
"cad.attachment.system_delete_disabled" = "Системные точки нельзя удалить";
"cad.canvas.grid" = "Сетка";
"cad.canvas.axes" = "Оси";
"cad.canvas.attachment_points" = "Точки крепления";
"cad.canvas.reference_planes" = "Плоскости";
"cad.canvas.active_plane" = "Плоскость";
"cad.canvas.active_plane_hidden" = "плоскость скрыта";
"cad.canvas.snap" = "Привязка";
"cad.canvas.snap_options" = "Настройки привязки";
"cad.canvas.grid_step" = "Шаг сетки";
"cad.canvas.grid.tooltip" = "Показать или скрыть сетку";
"cad.canvas.axes.tooltip" = "Показать или скрыть оси";
"cad.canvas.planes.tooltip" = "Показать или скрыть плоскости";
"cad.canvas.points.tooltip" = "Показать или скрыть точки привязки";
"cad.canvas.constraint_glyphs" = "Ограничения";
"cad.camera.iso.tooltip" = "Изометрический вид";
"cad.snap.grid" = "Сетка";
"cad.snap.sketch_vertex" = "Точка эскиза";
"cad.snap.body_vertex" = "Вершина";
"cad.snap.body_edge" = "Ребро";
"cad.snap.edge_midpoint" = "Середина";
"cad.snap.option.grid" = "Сетка";
"cad.snap.option.sketch_vertices" = "Вершины эскиза";
"cad.snap.option.body_vertices" = "Вершины тела";
"cad.snap.option.body_edges" = "Ребра тела";
"cad.snap.option.edge_midpoints" = "Середины ребер";
"cad.snap.construction_vertex" = "Вспом. точка";
"cad.snap.construction_line" = "Вспом. линия";
"cad.snap.construction_intersection" = "Пересечение";
"cad.snap.option.construction_points" = "Точки вспом. геометрии";
"cad.snap.option.construction_lines" = "Вспом. линии";
"cad.snap.option.construction_intersections" = "Пересечения вспом.";
"cad.construction.mode" = "Режим";
"cad.construction.mode.segment" = "Отрезок по двум точкам";
"cad.construction.mode.horizontal" = "Горизонтальная через точку";
"cad.construction.mode.vertical" = "Вертикальная через точку";
"cad.construction.mode.angle" = "По точке и углу";
"cad.construction.phase_hint.set_start" = "Нажмите для указания точки";
"cad.construction.phase_hint.set_end" = "Нажмите для второй точки";
"cad.construction.angle" = "Угол";
"cad.construction.info" = "Вспомогательная геометрия не включается в профили выдавливания. Используйте для привязок.";
"cad.status.snap_named" = "Snap: %@";
"cad.status.snap_grid_step" = "Snap: Сетка %@ мм";
"cad.status.snap_grid_off" = "Snap: сетка выкл.";
"cad.canvas.hint" = "Перетащите для вращения · Прокрутите для масштаба";
"cad.status.no_selection" = "Элемент не выбран";
"cad.status.elements" = "%d элементов";
"cad.unit.mm" = "мм";
"cad.unit.deg" = "град";
"cad.unit.grams" = "г";
"cad.unit.kg" = "кг";
"cad.warning.tube_radius" = "Внутренний радиус должен быть меньше внешнего.";
"cad.warning.attachment_duplicate_names" = "Имена точек крепления повторяются.";
"cad.warning.attachment_all_disabled" = "Все точки крепления отключены.";
"cad.warning.attachment_far_from_bounds" = "Пользовательская точка находится далеко от габаритов элемента.";
"cad.warning.attachment_missing_system" = "Не хватает системной точки крепления. Сбросьте системные точки.";
"cad.warning.sketch_plane_locked" = "Плоскость этого эскиза зафиксирована. Создайте новый эскиз для другой плоскости.";
"cad.warning.sketch_plane_locked_hint" = "Плоскость зафиксирована. Используйте кнопки XY / XZ / YZ выше для просмотра с другого ракурса. Для другой плоскости создайте новый эскиз.";
"cad.warning.constraint_conflict" = "Ограничение конфликтует с текущей геометрией.";
"cad.warning.face_required" = "Сначала выберите плоскую грань.";
"cad.info.face_sketch_available" = "Можно создать новый эскиз на выбранной грани.";

// CAD wing construction types
"cad.construction.solid" = "Цельная";
"cad.construction.foam_core" = "Пенный заполнитель";
"cad.construction.hollow_composite" = "Пустотелый композит";
"cad.construction.rib_and_skin" = "Нервюра и обшивка";
"cad.param.construction" = "Конструкция";

// CAD camera modes
"cad.camera.iso" = "Изо";
"cad.camera.top" = "Сверху";
"cad.camera.front" = "Спереди";
"cad.camera.side" = "Сбоку";
"cad.camera.fit" = "По объекту";
"cad.camera.reset" = "Сброс";

// CAD sketch mode
"cad.tool.arc" = "Дуга";
"cad.tool.arc.tooltip" = "Построить дугу по трём точкам";
"cad.tool.autoline" = "Авто-линия";
"cad.tool.construction" = "Вспомогательная";
"cad.templates.button" = "Шаблоны";
"cad.templates.title" = "Шаблоны";
"cad.op.cut" = "Вырез";
"cad.op.rib" = "Рёбро";
"cad.op.cut_future" = "Вырез — в будущей версии";
"cad.op.rib_future" = "Рёбро — в будущей версии";
"cad.tool.select" = "Выбор";
"cad.tool.line" = "Линия";
"cad.tool.rectangle" = "Прямоугольник";
"cad.tool.circle" = "Окружность";
"cad.tool.sketch_edit" = "Эскиз";
"cad.tool.finish" = "Завершить";
"cad.tool.cancel" = "Отмена";
"cad.ribbon.group.select" = "Выбор";
"cad.ribbon.group.geometry" = "Геометрия";
"cad.ribbon.group.sketch" = "Эскиз";
"cad.ribbon.group.operations" = "Операции";
"cad.ribbon.group.body" = "Элементы тела";
"cad.op.fillet" = "Скругление";
"cad.op.fillet_future" = "Скругление — в следующей версии";
"cad.op.chamfer" = "Фаска";
"cad.op.chamfer_future" = "Фаска — в следующей версии";
"cad.ribbon.group.view" = "Вид";
"cad.ribbon.group.display" = "Отображение";
"cad.ribbon.group.snap" = "Привязки";
"cad.ribbon.group.templates" = "Шаблоны";
"cad.sketch.default_name" = "Эскиз";
"cad.sketch.new" = "Новый эскиз";
"cad.sketch.new_on_plane" = "На";
"cad.sketch.face_base_name" = "Эскиз на грани";
"cad.sketch.face_reference" = "Этот эскиз привязан к выбранной грани тела.";
"cad.sketch.reference.face" = "Грань";
"cad.sketch.plane.xy_view" = "Спереди";
"cad.sketch.plane.xz_view" = "Сверху";
"cad.sketch.plane.yz_view" = "Сбоку";
"cad.sketch.plane_offset" = "Смещение плоскости";
"cad.sketch.metric.lines" = "Линии";
"cad.sketch.metric.contour" = "Контур";
"cad.sketch.metric.plane" = "Плоскость";
"cad.sketch.metric.status" = "Статус";
"cad.sketch.definition.under_defined" = "Недоопределен";
"cad.sketch.definition.constrained" = "С ограничениями";
"cad.sketch.definition.conflicting" = "Конфликт";
"cad.sketch.extrude_stage" = "Выдавить — Stage 1.6";
"cad.sketch.extrude_help_closed" = "Замкнутый контур готов к выдавливанию на следующем этапе.";
"cad.sketch.extrude_help_open" = "Для выдавливания нужен замкнутый контур.";
"cad.sketch.add_line" = "Добавить линию";
"cad.sketch.lines.empty" = "Линий пока нет. Задайте координаты и добавьте первый отрезок.";
"cad.sketch.line_title" = "Линия %d";
"cad.sketch.select_next_line" = "Следующая";
"cad.sketch.delete_line" = "Удалить линию";
"cad.sketch.massless" = "Эскиз без массы";
"cad.sketch.lines_count" = "%d линий";
"cad.sketch.contour.closed" = "контур замкнут";
"cad.sketch.contour.open" = "контур открыт";

// CAD дерево проекта
"cad.tree.part" = "Деталь";
"cad.tree.origin" = "Начало координат";
"cad.tree.planes" = "Плоскости";
"cad.tree.axes" = "Оси";
"cad.tree.sketches" = "Эскизы";
"cad.tree.elements" = "Элементы";
"cad.tree.extruded" = "Выдавленные";
"cad.tree.extruded_empty" = "Выдавленных тел пока нет.";

// CAD инструмент Линия (интерактивный)
"cad.line.idle" = "Инструмент «Линия» готов";
"cad.line.set_start" = "Нажмите, чтобы задать начальную точку";
"cad.line.set_end" = "Нажмите, чтобы задать конечную точку";
"cad.line.start_point" = "Начало";
"cad.line.end_point" = "Конец";
"cad.line.length" = "Длина";
"cad.line.angle" = "Угол";
"cad.line.select_sketch_first" = "Выберите или создайте эскиз для рисования линий.";
"cad.rectangle.set_first_corner" = "Нажмите, чтобы задать первый угол";
"cad.rectangle.set_opposite_corner" = "Нажмите, чтобы задать противоположный угол";
"cad.rectangle.width" = "Ш";
"cad.rectangle.height" = "В";
"cad.rectangle.title" = "Прямоугольник %d";
"cad.circle.set_center" = "Нажмите, чтобы задать центр";
"cad.circle.set_radius" = "Нажмите, чтобы задать радиус";
"cad.circle.radius" = "R";
"cad.circle.diameter" = "Ø";
"cad.circle.title" = "Окружность %d";
"cad.sketch.delete_entity" = "Удалить";
"cad.sketch.entity_count" = "%d фигур";
"cad.section.line_params" = "Параметры линии";
"cad.section.selected_sketch_line" = "Линия эскиза";
"cad.section.selected_sketch_rectangle" = "Прямоугольник";
"cad.section.selected_sketch_circle" = "Окружность";
"cad.section.sketch_shapes" = "Фигуры";
"cad.section.constraints" = "Ограничения";
"cad.constraint.horizontal" = "Горизонтальность";
"cad.constraint.vertical" = "Вертикальность";
"cad.constraint.fixed_start" = "Фиксировать начало";
"cad.constraint.fixed_end" = "Фиксировать конец";
"cad.constraint.coincident" = "Совпадение";
"cad.constraint.equal_length" = "Равная длина";
"cad.constraint.parallel" = "Параллельн.";
"cad.constraint.perpendicular" = "Перпендик.";

// Размеры эскиза
"cad.dim.line_length" = "Длина";
"cad.dim.line_angle" = "Угол";
"cad.dim.horizontal_distance" = "По горизонт.";
"cad.dim.vertical_distance" = "По вертик.";
"cad.dim.rectangle_width" = "Ширина";
"cad.dim.rectangle_height" = "Высота";
"cad.dim.circle_radius" = "Радиус";
"cad.dim.circle_diameter" = "Диаметр";

// Привязка к другим эскизам
"cad.snap.reference_sketch_vertex" = "Вершина";
"cad.snap.reference_sketch_edge_midpoint" = "Середина ребра";
"cad.snap.projected_sketch_vertex" = "Проекция вершины";
"cad.snap.projected_sketch_edge_midpoint" = "Проекция середины";
"cad.snap.option.reference_sketches" = "Ссылочные эскизы";
"cad.snap.circle_center" = "Центр окружности";
"cad.snap.body_vertex_solid" = "Вершина тела";
"cad.snap.body_edge_midpoint" = "Середина ребра тела";
"cad.snap.projected_circle_center" = "Проекция центра";

// CAD Выдавливание
"cad.kind.extruded_solid" = "Выдавленное тело";
"cad.section.extrude" = "Выдавливание";
"cad.section.extruded_solid" = "Выдавленная деталь";
"cad.extrude.dir.positive" = "+Нормаль";
"cad.extrude.dir.negative" = "−Нормаль";
"cad.extrude.dir.symmetric" = "Симметрично";
"cad.extrude.depth" = "Глубина";
"cad.extrude.direction" = "Направление";
"cad.extrude.material" = "Материал";
"cad.extrude.action" = "Выдавить";
"cad.extrude.contour_closed" = "Контур замкнут. Можно выдавливать.";
"cad.extrude.contour_open" = "Контур не замкнут. Замкните эскиз перед выдавливанием.";
"cad.extrude.unavailable_status" = "выдавливание недоступно";
"cad.extrude.disconnected_lines" = "Контур состоит из несвязанных отрезков.";
"cad.extrude.duplicate_points" = "Контур содержит повторяющиеся точки.";
"cad.extrude.insufficient_points" = "Недостаточно точек. Для выдавливания нужны минимум три уникальные точки.";
"cad.extrude.area_too_small" = "Площадь контура слишком мала.";
"cad.extrude.self_intersections" = "Самопересечения пока не поддерживаются.";
"cad.extrude.unsupported_contour" = "Extrude v1 поддерживает простые контуры из отрезков.";
"cad.extrude.source" = "Источник";
"cad.extrude.source_deleted" = "Источник удален";
"cad.extrude.source_deleted_named" = "%@ (источник удален)";
"cad.extrude.source_plane" = "Плоскость источника";
"cad.extrude.profile_points" = "Точки профиля";
"cad.extrude.volume" = "Объем";
"cad.face.front" = "Передняя";
"cad.face.back" = "Задняя";
"cad.face.side_n" = "Боковая %d";
"cad.face.list" = "Грани";
"cad.face.none" = "Для этого тела нет доступных плоских граней.";
"cad.face.selected" = "Выбрана грань: %@";
"cad.face.new_sketch" = "Новый эскиз на грани";
"cad.face.select_hint" = "Выберите грань, чтобы создать на ней эскиз.";
"cad.workplane.canonical_name" = "Плоскость %@";
"cad.workplane.inspector_title" = "Рабочая плоскость";
"cad.workplane.selected" = "Выбранная плоскость";
"cad.workplane.create_sketch" = "Создать эскиз";
"cad.workplane.normal" = "Нормально";
"cad.workplane.close" = "Закрыть";

"cad.camera.normal_to_sketch" = "К эскизу";
"cad.canvas.view_only" = "только вид";
"cad.status.snap_off" = "Привязка выкл.";

// Инструмент Дуга
"cad.arc.set_start" = "Кликните для начала дуги";
"cad.arc.set_end" = "Кликните для конца дуги";
"cad.arc.set_mid" = "Кликните для точки на дуге";
"cad.arc.mid_point" = "Точка на дуге";
"cad.arc.chord_length" = "Хорда";
"cad.arc.title" = "Дуга %d";
"cad.section.arc_params" = "Параметры дуги";

// Инструмент Авто-линия
"cad.autoline.idle" = "Кликните для начала авто-линии";
"cad.autoline.segment_count" = "%d сегментов";
"cad.autoline.last_point" = "Последняя точка";
"cad.autoline.next_point" = "Следующая точка";
"cad.autoline.finish" = "Завершить (открытая)";
"cad.autoline.finish_close" = "Завершить (замкнутая)";
"cad.section.autoline_params" = "Авто-линия";

// Режимы прямоугольника
"cad.rectangle.first_corner" = "Первый угол";
"cad.rectangle.opposite_corner" = "Противоположный угол";
"cad.rect.mode.two_corners" = "Два угла";
"cad.rect.mode.center_corner" = "Центр + угол";
"cad.rect.mode.size_first" = "Размер от первой";
"cad.section.rectangle_params" = "Режим ввода";

// Режимы окружности
"cad.circle.center" = "Центр";
"cad.circle.mode.radius" = "Радиус от центра";
"cad.circle.mode.diameter" = "Диаметр (2 точки)";
"cad.section.circle_params" = "Режим ввода";
